<?php
// ------------------------------------------------------------------------- //
// Coppermine Photo Gallery 1.3.2                                            //
// ------------------------------------------------------------------------- //
// Copyright (C) 2002-2004 Gregory DEMAR                                     //
// http://www.chezgreg.net/coppermine/                                       //
// ------------------------------------------------------------------------- //
// Updated by the Coppermine Dev Team                                        //
// (http://coppermine.sf.net/team/)                                          //
// see /docs/credits.html for details                                        //
// ------------------------------------------------------------------------- //
// This program is free software; you can redistribute it and/or modify      //
// it under the terms of the GNU General Public License as published by      //
// the Free Software Foundation; either version 2 of the License, or         //
// (at your option) any later version.                                       //
// ------------------------------------------------------------------------- //
// ENCODING CHECK; SHOULD BE YEN BETA MU: ¥ ß µ
// ------------------------------------------------------------------------- //
// CVS version: $Id: kurdish-utf-8.php,v 1.3 2004/12/29 23:03:50 chtito Exp $
// ------------------------------------------------------------------------- //

// info about translators and translated language
$lang_translation_info = array(
  'lang_name_english' => 'Kurdish',
  'lang_name_native' => 'كوردی',
  'lang_country_code' => 'ku',
  'trans_name'=> 'Hozhan ',
  'trans_email' => 'webmaster@worldmusic.cn',
  'trans_website' => 'http://worldmusic.cn/',
  'trans_date' => '2004-08-30',
);

$lang_charset = 'utf-8';
$lang_text_dir = 'rtl'; // ('ltr' for left to right, 'rtl' for right to left)

// shortcuts for Byte, Kilo, Mega
$lang_byte_units = array('بايت', 'کیلۆ بایت', 'مێگا بایت');

// Day of weeks and months
$lang_day_of_week = array('یه‌ك شه‌م', 'دوو شه‌م', 'سێ شه‌م', 'چوار شه‌م', 'پێنج شه‌م', 'هه‌ینی', 'شه‌مه');
$lang_month = array('ڕێبه‌ندان', 'ڕه‌شه‌مێ', 'نه‌ورۆز (خاكه‌لێوه‌)', 'بانه‌مه‌ڕ (گوڵان)', 'جۆزه‌ردان', 'پووشپه‌ڕ', 'خه‌رمانان', 'گه‌لاوێژ', 'ڕه‌زبه‌ر', 'گه‌ڵاڕێزان (خه‌زه‌ڵوه‌ر)', 'سه‌رماوز', 'به‌فرانبار');

// Some common strings
$lang_yes = 'به‌ڵێ';
$lang_no  = 'نه‌خێر';
$lang_back = 'گه‌ڕانه‌وه‌';
$lang_continue = 'به‌رده‌وام';
$lang_info = 'زانیاری';
$lang_error = 'هه‌ڵه‌';

// The various date formats
// See http://www.php.net/manual/en/function.strftime.php to define the variable below
$album_date_fmt =    '%B %d, %Y';
$lastcom_date_fmt =  '%m/%d/%y at %H:%M'; //cpg1.3.0
$lastup_date_fmt = '%B %d, %Y';
$register_date_fmt = '%B %d, %Y';
$lasthit_date_fmt = '%B %d, %Y at %I:%M %p'; //cpg1.3.0
$comment_date_fmt =  '%B %d, %Y at %I:%M %p'; //cpg1.3.0

// For the word censor
$lang_bad_words = array('*fuck*', 'asshole', 'assramer', 'bitch*', 'c0ck', 'clits', 'Cock', 'cum', 'cunt*', 'dago', 'daygo', 'dego', 'dick*', 'dildo', 'fanculo', 'feces', 'foreskin', 'Fu\(*', 'fuk*', 'honkey', 'hore', 'injun', 'kike', 'lesbo', 'masturbat*', 'motherfucker', 'nazis', 'nigger*', 'nutsack', 'penis', 'phuck', 'poop', 'pussy', 'scrotum', 'shit', 'slut', 'titties', 'titty', 'twaty', 'wank*', 'whore', 'wop*');

$lang_meta_album_names = array(
        'random' => 'وێنه‌ی تێكه‌ڵ',
        'lastup' => 'دوا زیادكراو',
        'lastalb'=> 'دوا نوێكراوه‌ی ئه‌لبووم',
        'lastcom' => 'دوا لێدوان',
        'topn' => 'زیاتر بینراوه‌',
        'toprated' => 'وێنه‌كانی باشترین پله‌یان وه‌رگرتووه‌‌‌‌',
        'lasthits' => 'دوا بینراو',
        'search' => 'ئه‌نجامی گه‌ڕان',
        'favpics'=> 'وێنه‌ی دڵخواز'
);

$lang_errors = array(
  'access_denied' => 'ده‌سه‌ڵاتت نیه‌ بۆ چوونه‌ ژووره‌وه‌ی ئه‌م په‌ڕه‌یه‌.',
  'perm_denied' => 'ده‌سه‌ڵاتت نیه‌ بۆ جێ به‌ جێ كردنی ئه‌م هه‌نگاوه‌.',
  'param_missing' => 'لقد نودي البرنامج بدون متغيرات.',
  'non_exist_ap' => 'ئه‌لبووم یان وێنه‌ی ده‌ستنیشانت كردیه‌ ئاماده‌ نیه‌‌!',
  'quota_exceeded' => 'له‌ سنوورلادانی لكاندن<br /><br />شوێنی پێدراوت [quota]K, وێنه‌كه‌ت شوێنی گرتیه‌ [space]K, به‌لكاندنی ئه‌م وێنه‌یه‌ ده‌بێته‌ هۆی له‌ سنوورلاندانی لكاندن.',
  'gd_file_type_err' => '.JPEG و PNG بكات ئه‌م كاته‌ ئازادی له‌ باكر هێنانی ئه‌م فۆڕماتانه‌ GD ئه‌گه‌ر بێتوو ئه‌لبوومه‌كه‌ت پشتیوانی',
  'invalid_image' => 'ناكات GD ئه‌م وێنه‌ی هه‌ڵتبژاردیه‌ ناتوانرێت جێ به‌جێ بكرێت چوونكه‌ پشتیوانی ',
  'resize_failed' => 'ناتواندرێت قه‌باره گه‌وره‌ی یان بچووكی وێنه‌كه‌ بگۆڕیت.',
  'no_img_to_display' => 'وێنه‌ نیه‌ بۆ نیشاندان',
  'non_exist_cat' => 'هاوپله‌ی ده‌ستنیشان كراوه‌ نیه‌',
  'orphan_cat' => 'هاوپۆله‌كه‌ هاوپۆلی سه‌ره‌كی نیه‌, شێوازی به‌ڕێوه‌به‌راتی به‌كاربینه‌ بۆ چاره‌كردنی ئه‌م كێشه‌یه‌.',
  'directory_ro' => 'بوخچه‌یه‌ \'%s\' ناتوانرێت بنووسرێت, وێنه‌ ناتوانرێت بسڕێته‌وه‌‌',
  'non_exist_comment' => 'لێدوانی ده‌ستنیشان كراو ئاماده‌ نیه‌.',
  'pic_in_invalid_album' => 'وێنه‌یه‌ ئاماده‌ نیه‌ له‌م ئه‌لبوومه (%s)!?',
  'banned' => 'تۆ به‌داخه‌وه‌ له‌ ده‌ستت داوه‌‌ بۆ به‌كار هێنانی ئه‌م لاپه‌ڕه‌یه.',
  'not_with_udb' => 'ئه‌م ئامرازه‌ له‌كار خراوه‌ له‌ لایه‌ن پیشانگا.',
  'offline_title' => 'ئه‌لبووم ده‌ر‌هێڵه‌‌ (له‌كار كه‌وتیه‌) ئێستا', //cpg1.3.0
  'offline_text' => 'پێشاندان ده‌رهێڵه‌‌ یاخوود له‌ كار كه‌وتیه‌ كاتێكی تر سه‌ردان بكه‌وه', //cpg1.3.0
  'ecards_empty' => 'هیچ پۆست كارتێك نیه‌ پێشان بدرێت‌، سه‌یر بكه‌ له‌ به‌شی شێوه‌پێدان بزانه‌ پاشكه‌وت كردنی پۆست كارت به‌كار خراوه‌‌!', //cpg1.3.0
  'action_failed' => 'كارێكی هه‌ڵه‌، ناتوانرێت ئه‌م كاره‌ جێ به‌جێ بكات.', //cpg1.3.0
  'no_zip' => 'تایبه‌ت مه‌ندیه‌كانی په‌ڕگه‌ی زیپ ئازاد نیه‌، هه‌وڵ بده‌ په‌یوه‌ندی بكه‌ به‌ به‌ڕێوه‌به‌ری لاپه‌ڕه‌كه‌.', //cpg1.3.0
  'zip_type' => 'تۆ ڕێگات پێنه‌دراوه‌ بۆ لكاندنی په‌ڕگه‌ی زیپ.', //cpg1.3.0
);

$lang_bbcode_help = 'ئه‌م نیشانانه‌ سوودی هه‌یه‌ بۆ یارمه‌تی : <li>[b]<b>ڕه‌ش</b>[/b]</li> <li>[i]<i>ئی مه‌یل</i>[/i]</li> <li>[url=http://yoursite.com/]به‌سته‌ر[/url]</li> <li>[email]user@domain.com[/email]</li>'; //cpg1.3.0

// ------------------------------------------------------------------------- //
// File theme.php
// ------------------------------------------------------------------------- //

$lang_main_menu = array(
        'alb_list_title' => 'بچۆ لیستی ئه‌لبوومه‌كان',
        'alb_list_lnk' => 'لیستی ئه‌لبوومه‌كان',
        'my_gal_title' => 'بچۆ ئه‌لبوومه‌ تایبه‌تیه‌كان',
        'my_gal_lnk' => 'ئه‌لبوومی تایبه‌تی',
        'my_prof_lnk' => 'زانیاریه‌كانم',
        'adm_mode_title' => 'گواستنه‌وه‌ بۆ شێوازی به‌ڕێوه‌به‌ر',
        'adm_mode_lnk' => 'شێوازی به‌ڕێوه‌به‌ر',
        'usr_mode_title' => 'گواستنه‌وه‌ بۆ شێوازی به‌كارهێنه‌ر',
        'usr_mode_lnk' => 'شێوازی به‌كارهێنه‌ر',
        'upload_pic_title' => 'لكاندنی وێنه‌ بۆ‌ ئه‌لبووم',
        'upload_pic_lnk' => 'لكاندنی وێنه‌',
        'register_title' => 'به‌ ئه‌ندام بوون',
        'register_lnk' => 'تۆمار كردن',
        'login_lnk' => 'چوونه‌ ژووره‌وه‌‌',
        'logout_lnk' => 'ده‌رچوون',
        'lastup_lnk' => 'دوا لكاندراو',
        'lastcom_lnk' => 'دووا لێدوان',
        'topn_lnk' => 'زیاتر بینراوه‌',
        'toprated_lnk' => 'باشترین پله‌‌',
        'search_lnk' => 'گه‌ڕان',
        'fav_lnk' => 'دڵخواز',
  'memberlist_title' => 'پێشاندانی لیستی ئه‌ندامه‌كان', //cpg1.3.0
  'memberlist_lnk' => 'لیستی ئه‌ندامه‌كان', //cpg1.3.0
  'faq_title' => 'پرسیارو وه‌ڵام ده‌رباره‌ی ئه‌لبوومی وێنه‌كان &quot;Coppermine&quot;', //cpg1.3.0
  'faq_lnk' => 'پهد', //cpg1.3.0
);

$lang_gallery_admin_menu = array(
  'upl_app_lnk' => 'ڕازی بوونی لكاندن',
  'config_lnk' => 'شێوه‌پێدان',
  'albums_lnk' => 'ئه‌لبوومه‌كان',
  'categories_lnk' => 'هاوپۆله‌كان',
  'users_lnk' => 'به‌كارهێنه‌ره‌كان',
  'groups_lnk' => 'گرووپ',
  'comments_lnk' => 'گه‌ڕانه‌وه‌ بۆ لێدوانه‌كان', //cpg1.3.0
  'searchnew_lnk' => 'خستنه‌سه‌ڕی كۆمه‌ڵیك په‌ڕگه‌‌', //cpg1.3.0
  'util_lnk' => 'ئامراز‌ی به‌ڕێوه‌به‌ر', //cpg1.3.0
  'ban_lnk' => 'ڕێگرتنی به‌كارهێنه‌ر',
  'db_ecard_lnk' => 'پێشاندانی كارته‌كان', //cpg1.3.0
);

$lang_user_admin_menu = array(
        'albmgr_lnk' => 'داخستن / ڕێك خستنی ئه‌لبوومه‌كانم',
        'modifyalb_lnk' => 'ده‌سكاری ئه‌لبوومه‌كانم',
        'my_prof_lnk' => 'زانیاریه‌كانم',
);

$lang_cat_list = array(
        'category' => 'هاوپۆله‌كان',
        'albums' => 'ئه‌لبوومه‌كان',
        'pictures' => 'وێنه‌',
);

$lang_album_list = array(
        'album_on_page' => '%d ئه‌لبووم له‌ %d لاپه‌ڕه‌'
);

$lang_thumb_view = array(
        'date' => 'ڕێكه‌وت',
  //Sort by filename and title
  'name' => 'ناوی په‌ڕگه‌',
  'title' => 'ناونیشان',
  'sort_da' => 'ڕیزكردن به‌ گوێره‌ی سه‌رووی ڕێكه‌وت',
  'sort_dd' => 'ڕیزكردن به‌ گوێره‌ی خوارووی ڕێكه‌وت',
  'sort_na' => 'ڕیزكردن به‌ گوێره‌ی سه‌رووی ناو',
  'sort_nd' => 'ڕیزكردن به‌ گوێره‌ی خوارووی ناو',
  'sort_ta' => 'ڕیزكردن به‌ گوێره‌ی سه‌رووی ناونیشان',
  'sort_td' => 'ڕیزكردن به‌ گوێره‌ی خوارووی ناونیشان',
  'download_zip' => 'دابه‌زاندنی وه‌ك شێوازی zip', //cpg1.3.0
  'pic_on_page' => '%d وێنه‌ له‌ %d لاپه‌ڕه‌/لاپه‌ڕه‌كان',
  'user_on_page' => '%d به‌كارهێنه‌ر له‌ %d لاپه‌ڕه‌', //cpg1.3.0
);

$lang_img_nav_bar = array(
  'thumb_title' => 'گه‌ڕانه‌وه‌ بۆ خشته‌ی ئه‌لبووم',
  'pic_info_title' => 'پێشاندان/شاردنه‌وه‌ی زانیاری وێنه‌', //cpg1.3.0
  'slideshow_title' => 'پێشاندانی وێنه‌كان به‌دوا یه‌ك',
  'ecard_title' => 'ئه‌م وێنه‌یه‌ بنێره‌ وه‌ك كارت‌', //cpg1.3.0
  'ecard_disabled' => 'ناردنی كارت له‌ كارخراوه‌',
  'ecard_disabled_msg' => 'ده‌سه‌ڵاتت نیه‌ بۆ ناردنی كارت', //js-alert //cpg1.3.0
  'prev_title' => 'وێنه‌ی پێشتر', //cpg1.3.0
  'next_title' => 'وێنه‌ی دواتر', //cpg1.3.0
  'pic_pos' => 'وێنه‌ %s/%s', //cpg1.3.0
);

$lang_rate_pic = array(
        'rate_this_pic' => 'پله‌ بده‌ بۆ ئه‌م وێنه‌',
        'no_votes' => '(پله‌ی بۆ نه‌دراوه‌‌)',
        'rating' => '(پله‌دانانه‌كانی ئێستا : %s / 5 له‌گه‌ڵ %s پله‌دانان)',
        'rubbish' => 'بۆ ته‌نه‌كه‌ی زبڵ‌',
        'poor' => 'خراپ نیه‌‌‌‌',
        'fair' => 'نزیكی باشه‌',
        'good' => 'باشه‌',
        'excellent' => 'زۆر باشه‌',
        'great' => 'سه‌رووی باشی',
);

// ------------------------------------------------------------------------- //
// File include/exif.inc.php
// ------------------------------------------------------------------------- //

// void

// ------------------------------------------------------------------------- //
// File include/functions.inc.php
// ------------------------------------------------------------------------- //

$lang_cpg_die = array(
  INFORMATION => $lang_info,
  ERROR => $lang_error,
  CRITICAL_ERROR => 'هه‌ڵه‌كی گه‌وره‌',
  'file' => 'په‌ڕگه ‌: ',
  'line' => 'هێڵ : ',
);

$lang_display_thumbnails = array(
        'filename' => 'ناوی په‌ڕگه‌ : ',
        'filesize' => 'قه‌باره‌ی : ',
        'dimensions' => 'ڕووخسار : ',
        'date_added' => 'خستنه‌سه‌ر كرا له‌ ڕێكه‌وتی : '
);

$lang_get_pic_data = array(
        'n_comments' => '%s لێدوان',
        'n_views' => '%s جار بینراوه‌',
        'n_votes' => '(%s پله‌دانان)'
);

$lang_cpg_debug_output = array(
  'debug_info' => 'زانیاری Debug', //cpg1.3.0
  'select_all' => 'هه‌ڵبژاردنی هه‌مووی', //cpg1.3.0
  'copy_and_paste_instructions' => 'If you\'re going to request help on the coppermine support board, copy-and-paste this debug output into your posting. Make sure to replace any passwords from the query with *** before posting.', //cpg1.3.0
  'phpinfo' => 'بینینی زانیاری php', //cpg1.3.0
);

$lang_language_selection = array(
  'reset_language' => 'زمانی بنه‌ڕه‌تی (كوردی)', //cpg1.3.0
  'choose_language' => 'زمان هه‌ڵبژێره‌', //cpg1.3.0
);

$lang_theme_selection = array(
  'reset_theme' => 'شێواز‌ی سه‌ره‌كی', //cpg1.3.0
  'choose_theme' => 'شێوازێك هه‌ڵبژێره‌', //cpg1.3.0
);

// ------------------------------------------------------------------------- //
// File include/init.inc.php
// ------------------------------------------------------------------------- //

// void

// ------------------------------------------------------------------------- //
// File include/picmgmt.inc.php
// ------------------------------------------------------------------------- //

// void

// ------------------------------------------------------------------------- //
// File include/smilies.inc.php
// ------------------------------------------------------------------------- //

if (defined('SMILIES_PHP')) $lang_smilies_inc_php = array(
        'Exclamation' => 'سه‌ڕسومان',
        'Question' => 'پرسیار',
        'Very Happy' => 'زۆر دڵخۆشم',
        'Smile' => 'پێكه‌نین',
        'Sad' => 'دڵ ته‌نگ',
        'Surprised' => 'زۆر سه‌ڕسومان',
        'Shocked' => 'زۆر سه‌یر',
        'Confused' => 'ممم',
        'Cool' => 'سه‌یر',
        'Laughing' => 'پێ ده‌كه‌نیت',
        'Mad' => 'تووڕه‌',
        'Razz' => 'نا ڕازی',
        'Embarassed' => 'شه‌رمه‌زار',
        'Crying or Very sad' => 'ده‌گریا',
        'Evil or Very Mad' => 'زۆر تووڕه',
        'Twisted Evil' => 'ئاماده‌یه‌ بۆ شه‌ڕ',
        'Rolling Eyes' => 'چاو سوووڕان',
        'Wink' => 'چاو نوقان',
        'Idea' => 'بیر',
        'Arrow' => 'نیشانه‌',
        'Neutral' => 'ئاسای',
        'Mr. Green' => 'كاكی سه‌وز',
);

// ------------------------------------------------------------------------- //
// File addpic.php
// ------------------------------------------------------------------------- //

// void

// ------------------------------------------------------------------------- //
// File admin.php
// ------------------------------------------------------------------------- //

if (defined('ADMIN_PHP')) $lang_admin_php = array(
  0 => 'وازهێنان له‌ به‌ڕێوه‌به‌راتی . . .',
  1 => 'چوونه‌ ژووره‌ی به‌ شێوازی به‌ڕێوه‌به‌راتی ...',
);

// ------------------------------------------------------------------------- //
// File albmgr.php
// ------------------------------------------------------------------------- //

if (defined('ALBMGR_PHP')) $lang_albmgr_php = array(
        'alb_need_name' => 'ئه‌لبوومه‌كه‌ پێویستی به‌ ناوێكه‌ !',
        'confirm_modifs' => 'تۆ دڵنیای له‌ خستنه‌سه‌ری ئه‌م ده‌سكاریه‌  ?',
        'no_change' => 'هیچ گۆڕانكاریه‌ك نه‌كرا !',
        'new_album' => 'ئه‌لبوومی نوێ',
        'confirm_delete1' => 'تۆ دڵنیای له‌ سڕینه‌وه‌ ئه‌م ئه‌لبوومه‌ ?',
        'confirm_delete2' => '\nئێستا وێنه‌كان و لێدوانه‌كان هه‌موو ده‌سڕێته‌وه‌ !',
        'select_first' => 'یه‌كه‌م جار پێویسته‌ ئه‌لبوومێك ده‌ستنیشان كه‌ێ',
        'alb_mrg' => 'به‌ڕێوه‌به‌ری ئه‌لبووم',
        'my_gallery' => '* پێشانگاكه‌م *',
        'no_category' => '* پیشانگا نیه‌ *',
        'delete' => 'سڕینه‌وه‌',
        'new' => 'نوێ',
        'apply_modifs' => 'پاشكه‌وت كردنی ده‌سكاریه‌كه‌ ',
        'select_category' => 'هاوپۆلێك هه‌ڵبژێره‌ ',
);

// ------------------------------------------------------------------------- //
// File catmgr.php
// ------------------------------------------------------------------------- //

if (defined('CATMGR_PHP')) $lang_catmgr_php = array(
        'miss_param' => 'زانیاری داواكرو بۆ كاره‌كه \'%s\'نه‌دراوه‌ !',
        'unknown_cat' => 'هاوپۆلی ده‌ستنیشان كراو له‌ داته‌باسه‌دا نیه‌',
        'usergal_cat_ro' => 'هاوپۆلی پیشانگای ئه‌ندام ناتونرێت بسڕێته‌وه‌‌ !',
        'manage_cat' => 'به‌ڕێوه‌به‌ری هاوپۆله‌كان',
        'confirm_delete' => 'تۆ دڵنیای له‌ سڕینه‌وه‌ی ئه‌م هاوپۆله‌',
        'category' => 'هاوپۆل',
        'operations' => 'كاره‌كان',
        'move_into' => 'بگوازه‌وه‌ بۆ',
        'update_create' => 'نوێ كردنه‌وه/ دروست كردنی هاوپۆل',
        'parent_cat' => 'هاوپۆلی سه‌ره‌كی',
        'cat_title' => 'ناونیشانی هاوپۆل',
        'cat_thumb' => 'هاوپۆلی وێنه‌كان', //cpg1.3.0
        'cat_desc' => 'ده‌رباره‌ی هاوپۆل'
);

// ------------------------------------------------------------------------- //
// File config.php
// ------------------------------------------------------------------------- //

if (defined('CONFIG_PHP')) $lang_config_php = array(
        'title' => 'شێوه‌پێدانه‌كان',
        'restore_cfg' => 'گه‌ڕانه‌وه‌ بۆ بنه‌ڕه‌تی',
        'save_cfg' => 'پاشكه‌وت كردنی شێوه‌پێدان‌',
        'notes' => 'تێبینی',
        'info' => 'زانیاری',
        'upd_success' => 'به‌سه‌ركه‌وتووانه‌ شێوه‌پێدانه‌كه‌ نوێكراوه‌',
        'restore_success' => 'به‌سه‌ركه‌وتووانه‌ شێوه‌پێدانه‌كه‌ گه‌ڕاوه‌ باری بنه‌ڕه‌تی',
        'name_a' => 'له‌ سه‌رووی ناو',
        'name_d' => 'له‌ خوارووی ناو',
        'title_a' => 'له‌ سه‌رووی ناونیشان',
        'title_d' => 'له‌ خوارووی ناو',
        'date_a' => 'له‌ سه‌رووی مێژوو',
        'date_d' => 'له‌ خوارووی مێژوو',
        'th_any' => 'زیاترین درێژیوو پانی',
        'th_ht' => 'درێژی',
        'th_wd' => 'پانی',
        'label' => 'وێنه‌ی ئاڵا', //cpg1.3.0
        'item' => 'ناوی زمان', //cpg1.3.0
        'debug_everyone' => 'هه‌مووی', //cpg1.3.0
        'debug_admin' => 'ته‌نها به‌ڕێوه‌به‌ر', //cpg1.3.0
        );

if (defined('CONFIG_PHP')) $lang_config_data = array(
  'ئامرازی گشتی',
  array('ناوی پیشانگا', 'gallery_name', 0),
  array('ده‌رباره‌ی پیشانگا', 'gallery_description', 0),
  array('پۆستی به‌ڕێوه‌به‌ری پیشانگا', 'gallery_admin_email', 0),
  array('ناونیشانی به‌سته‌ری بینینی \' زیاتر كارتی تر\' له‌ پۆست كارتدا', 'ecards_more_pic_target', 0),
  array('پیشانگا ئێستا ده‌رهێڵه‌', 'offline', 1), //cpg1.3.0
  array('پاشكه‌وتی پۆست كارت', 'log_ecards', 1), //cpg1.3.0
  array('ڕێگا بدرێت به‌ دابه‌زاندنی په‌ڕگه‌یzipباشه‌', 'enable_zipdownload', 1), //cpg1.3.0

  'ئامرازی زمان و شێواز و پیت',
  array('زمان', 'lang', 5),
  array('شێواز', 'theme', 6),
  array('پیشاندانی لیستی زمان', 'language_list', 1), //cpg1.3.0
  array('پێشاندانی ئاڵای وڵات', 'language_flags', 8), //cpg1.3.0
  array('پێشاندانی گه‌ڕانه‌وه‌ی بنه‌ڕه‌تی له‌ زمان', 'language_reset', 1), //cpg1.3.0
  array('پێشاندانی لیستی شێوازه‌كان', 'theme_list', 1), //cpg1.3.0
  array('پێشاندانی گه‌ڕانه‌وه‌ی بنه‌ڕه‌تی له‌ شێواز', 'theme_reset', 1), //cpg1.3.0
  array('پێشاندانی پهد یاخوود پرسیاری هه‌م دووباره‌', 'display_faq', 1), //cpg1.3.0
  array('پێشاندانی یارمه‌تی bbcode', 'show_bbcode_help', 1), //cpg1.3.0
  array('جۆری پیت', 'charset', 4), //cpg1.3.0

  'پێشاندانی لیستی پیشانگا',
        array('پێشاندانی خشته‌ی پێشاندانی وێنه‌ (به‌ خاڵو ڕێژه‌)', 'main_table_width', 0),
        array('ڕێژه‌ی ژماره‌ی پێشاندان له‌ هاوپۆل', 'subcat_level', 0),
        array('ژماره‌ی ئه‌لبوومه‌كانی پیشان ده‌درێت', 'albums_per_page', 0),
        array('ژماره‌ی خانه‌كان له‌ لیستی ئه‌لبووم', 'album_list_cols', 0),
        array('قیاسی وێنه‌ بچووكه‌كان به‌ خاڵی پیكسل بێت', 'alb_list_thumb_size', 0),
        array('تایبه‌تمه‌ندیه‌كانی لاپه‌ڕه‌ی سه‌ره‌كی', 'main_page_layout', 0),
            array('پێشاندانی تایبه‌تمه‌نیه‌كانی ئه‌لبووم له‌ هاوپۆله‌كان ','first_level',1),

  'ڕێگای پێشاندانی وێنه‌ ‌له‌ لاپه‌ڕه‌ی سه‌ره‌كی',
  array('ژماره‌ی خانه‌كانی لاپه‌ڕه‌ی سه‌ره‌كی وێنه‌كان', 'thumbcols', 0),
  array('ژماره‌ی خشته‌كانی لاپه‌ڕه‌ی سه‌ره‌كی وێنه‌كان', 'thumbrows', 0),
  array('گه‌وره‌ترین ژماره‌ی لاپه‌ڕه‌ كه‌ پێشان ده‌درێت له‌ لاپه‌ڕه‌', 'max_tabs', 10), //cpg1.3.0
  array('پێشاندانی ناونیشانی هه‌موو وێنه‌ك له‌ خوار وێنه‌', 'caption_in_thumbview', 1), //cpg1.3.0
  array('پێشاندانی چه‌ندجار بینراوه‌ له‌ خوار وێنه‌', 'views_in_thumbview', 1), //cpg1.3.0
  array('پێشاندانی لێدوانه‌كان له‌ خوار وێنه‌كه‌', 'display_comment_count', 1),
  array('نیشاندانی ناوی لكاندنی په‌ڕگه‌كه‌', 'display_uploader', 1), //cpg1.3.0
  array('ڕیزكردنی بنه‌ڕه‌تی په‌ڕگه‌كان به‌ گوێره‌ی', 'default_sort_order', 3), //cpg1.3.0
  array('پێشاندانی كه‌مترین ژماره‌ی پله‌ دانانه‌كان وێنه‌ له‌ لیستی‌‌  \'به‌رزترین پله‌\'', 'min_votes_for_rating', 0),

  'ئامرازه‌كانی بینینی وێنه‌ و لێدوان',
  array('پێشاندانی خشته‌ بۆ پێشاندانی وێنه‌ (به‌ خاڵو قه‌باره‌)', 'picture_table_width', 0), //cpg1.3.0
  array('پێشاندانی زانیاری بنه‌ڕه‌تی وێنه‌', 'display_pic_info', 1), //cpg1.3.0
  array('ڕێگرتن له‌ ووشه‌ی هه‌ڵه‌ ', 'filter_bad_words', 1),
  array('ڕێگه‌دان له‌ به‌كار‌هێنانی نیشانه‌ی پێكه‌نین له‌ لێدوان', 'enable_smilies', 1),
  array('ڕێگه‌دان به‌ دووباره‌ نووسینی لێداون له‌ لایه‌ن هه‌مان به‌كارهێنه‌ر له‌ هه‌مان وێنه‌دا', 'disable_comment_flood_protect', 1), //cpg1.3.0
  array('گه‌وره‌رتین درێژی پێناسه‌ی وێنه‌', 'max_img_desc_length', 0),
  array('گه‌وره‌ترین ژماره‌ی پیت له‌ ووشه‌ك', 'max_com_wlength', 0),
  array('گه‌ورره‌ترین ژماره‌ی هێل له‌ لێدوان', 'max_com_lines', 0),
  array('گه‌وره‌ترین درێژی له‌ لێدوان', 'max_com_size', 0),
  array('بینینی شریتی فلیم', 'display_film_strip', 1),
  array('ژماره‌ی وێنه‌ له‌ شریتی فلیم', 'max_film_strip_items', 0),
  array('ئاگادری به‌ڕێوه‌به‌ر بكه‌وه‌ به‌ پۆست له‌ لێدوانه‌كان', 'email_comment_notification', 1), //cpg1.3.0
  array('ماوه‌ی پێشاندانی به‌ به‌شه‌كی چركه‌یه‌ (1 چركه‌ = 1000 به‌ش له‌ چركه‌یه‌ك)', 'slideshow_interval', 0), //cpg1.3.0

  'ئامرازه‌كانی وێنه‌ و كوچكی وێنه‌', //cpg1.3.0
  array('قوالیتی بۆ JPEG', 'jpeg_qual', 0),
  array('گه‌وره‌ترین قیاسی كوچكی وێنه‌<a href="#notice2" class="clickable_option">**</a>', 'thumb_width', 0), //cpg1.3.0
  array('قیاسه‌كان به‌كار بێنه‌ (پێشاندانی درێژی و پانی دووری كوچكی وێنه‌ )<b>**</b>', 'thumb_use', 7),
  array('ئافراندنی وێنه‌ی ئینته‌رمیدیا','make_intermediate',1),
  array('گه‌وره‌ترین درێژیو پانی وێنه‌ی ئینته‌رمیدیا/ڤیدێو <a href="#notice2" class="clickable_option">**</a>', 'picture_width', 0), //cpg1.3.0
  array('گه‌وره‌ترین قه‌باره‌ی وێنه‌ بۆ لكاندن  (به‌ كیلۆبایت)', 'max_upl_size', 0), //cpg1.3.0
  array('گه‌وره‌ترین درێژی یان پانی وێنه‌ی ئینته‌رمیدیا ڤیدێو به‌ خاڵی ( پيكسل )', 'max_upl_width_height', 0), //cpg1.3.0

  'ئامرازه‌كانی پێشاندانی وێنه‌و كوچكی وێنه‌', //cpg1.3.0
  array('پێشاندانی وێنۆچكه‌ی ئه‌لبوومی تایبه‌تی به‌كارهێنه‌ری نه‌ هاتوو ژوور','show_private',1), //cpg1.3.0
  array('نیشانه‌كانی ڕێگره‌ له‌ به‌كارهێنانی له‌ ناوی په‌ڕگه‌', 'forbiden_fname_char',0), //cpg1.3.0
  //array('Accepted file extensions for uploaded pictures', 'allowed_file_extensions',0), //cpg1.3.0
  array('ڕێگه‌دان به‌ پاشكۆی وێنه‌', 'allowed_img_types',0), //cpg1.3.0
  array('ڕێگه‌دان به‌ جۆره‌كانی ڤیدێو', 'allowed_mov_types',0), //cpg1.3.0
  array('ڕێگه‌دان به‌ جۆره‌كانی ده‌نگ', 'allowed_snd_types',0), //cpg1.3.0
  array('ڕێگه‌دان به‌ جۆره‌كانی به‌ڵگه‌نامه‌', 'allowed_doc_types',0), //cpg1.3.0
  array('به‌رنامه‌ی بچووك كه‌ره‌واكانی به‌كاری ده‌هێنی','thumb_method',2), //cpg1.3.0
  array('Path to ImageMagick \'convert\' utility (example /usr/bin/X11/)', 'impath', 0), //cpg1.3.0
  //array('Allowed image types (only valid for ImageMagick)', 'allowed_img_types',0), //cpg1.3.0
  array('Command line options for ImageMagick', 'im_options', 0), //cpg1.3.0
  array('بخوێنه‌وه‌ دراوه‌كانی EXIF له‌ په‌ڕگه‌كانی JPEG', 'read_exif_data', 1), //cpg1.3.0
  array('بخوێنه‌وه‌ دراوه‌كانی IPTC له‌ په‌ڕگه‌كانی JPEG', 'read_iptc_data', 1), //cpg1.3.0
  array('بوخچه‌ی ئه‌لبووم <a href="#notice1" class="clickable_option">*</a>', 'fullpath', 0), //cpg1.3.0
  array('بوخچه‌ی په‌ڕگه‌كانی ئه‌ندامان <a href="#notice1" class="clickable_option">*</a>', 'userpics', 0), //cpg1.3.0
  array('وێنه‌ی ئینته‌رمیدیا ده‌ست پێده‌كات به‌ <a href="#notice1" class="clickable_option">*</a>', 'normal_pfx', 0), //cpg1.3.0
  array('وێنه‌ی بچووك ده‌ست پێده‌كات به‌<a href="#notice1" class="clickable_option">*</a>', 'thumb_pfx', 0), //cpg1.3.0
  array('دۆخی بنه‌ڕه‌تی بۆ بوخچه‌', 'default_dir_mode', 0), //cpg1.3.0
  array('دۆخی بنه‌ڕه‌تی بۆ په‌ڕگه‌', 'default_file_mode', 0), //cpg1.3.0

  'ئامرازه‌كانی به‌كارهێنه‌ر',
  array('ڕێگه‌دان به‌ تۆماركردن‌', 'allow_user_registration', 1),
  array('دڵنیابوونی تۆماركردن به‌ پۆستی ئه‌لیكترۆنی', 'reg_requires_valid_email', 1),
  array('ئاگاداری به‌ڕێوه‌به‌ر بكه‌ له‌ تۆماركدنی نوێی به‌كارهێنه‌ر', 'reg_notify_admin_email', 1), //cpg1.3.0
  array('ڕێگه‌دان به‌ پۆستی تۆماركراو', 'allow_duplicate_emails_addr', 1),
  array('به‌كارهێنه‌ر ده‌توانێت ئه‌لبوومی تایبه‌تی خۆی هه‌بێت (تێبینی: ئه‌گه‌ر نه‌خێر هه‌ڵبژێریت واتا ئه‌لبوومه‌كانی پێشتریش هه‌مووی ده‌بێته‌ گشتی )', 'allow_private_albums', 1), //cpg1.3.0
  array('ئاگاداری به‌ڕێوه‌به‌ر بكه‌ به‌كارهێنه‌ر چاوه‌ڕێی ڕازیبوونی لكاندن ده‌كات', 'upl_notify_admin_email', 1), //cpg1.3.0
  array('ڕێگه‌دان به‌ به‌كارهێنه‌ر لیستی ئه‌ندامان ببینی', 'allow_memberlist', 1), //cpg1.3.0

  'دراوی زانیاری زیاتری وێنه‌ (به‌ به‌تاڵی جێی بهێڵه‌ گه‌ر ناته‌وێت زانیاری زیاد بكه‌ی)',
        array('ناوی خانه‌ی یه‌كه‌م', 'user_field1_name', 0),
        array('ناوی خانه‌ی دووه‌م', 'user_field2_name', 0),
        array('ناوی خانه‌ی سێیه‌م', 'user_field3_name', 0),
        array('ناوی خانه‌ی چواره‌م', 'user_field4_name', 0),

  'ئامرازه‌كانی ووشكه‌ شیرینی (كووكی)',
        array('ناوی ووشكه‌شیرینی به‌كارهێنه‌ر له‌ به‌رنامه‌', 'cookie_name', 0),
        array('بوخچه‌ی ووشكه‌شیرینی به‌كارهێنه‌ر له‌ به‌رنامه', 'cookie_path', 0),

  'ئامرازی تر',
  array('به‌كارخستنی دۆخی دێبوگ', 'debug_mode', 9), //cpg1.3.0
  array('له‌كارخستنی تێبینی له‌ دۆخی دێبوگ', 'debug_notice', 1), //cpg1.3.0

  '<br /><div align="left"><a name="notice1"></a>(*) This settings mustn\'t be changed if you already have files in your database.<br />
  <a name="notice2"></a>(**) When changing this setting, only the files that are added from that point on are affected, so it is advisable that this setting must not be changed if there are already files in the gallery. You can, however, apply the changes to the existing files with the &quot;<a href="util.php">admin tools</a> (resize pictures)&quot; utility from the admin menu.</div><br />', //cpg1.3.0
);

// ------------------------------------------------------------------------- //
// File db_ecard.php //cpg1.3.0
// ------------------------------------------------------------------------- //

if (defined('DB_ECARD_PHP')) $lang_db_ecard_php = array(
  'title' => 'ناردنی پۆست كارت', //cpg1.3.0
  'ecard_sender' => 'ناوی كارت نێر', //cpg1.3.0
  'ecard_recipient' => 'ناوی كارت وه‌رگر ', //cpg1.3.0
  'ecard_date' => 'مێژوو', //cpg1.3.0
  'ecard_display' => 'پێشاندانی پۆست كارت', //cpg1.3.0
  'ecard_name' => 'ناو', //cpg1.3.0
  'ecard_email' => 'پۆستی ئه‌لیكترۆنی', //cpg1.3.0
  'ecard_ip' => 'IP #', //cpg1.3.0
  'ecard_ascending' => 'سه‌رووی', //cpg1.3.0
  'ecard_descending' => 'خوارووی', //cpg1.3.0
  'ecard_sorted' => 'ڕیزكراوه‌', //cpg1.3.0
  'ecard_by_date' => 'به‌ گوێره‌ی مێژووی', //cpg1.3.0
  'ecard_by_sender_name' => 'به‌ گوێره‌ی ناوی نێنه‌ر', //cpg1.3.0
  'ecard_by_sender_email' => 'به‌گوێره‌ێ پۆستی ئه‌لیكترۆنی نێنه‌ر', //cpg1.3.0
  'ecard_by_sender_ip' => 'by sender\'s IP address', //cpg1.3.0
  'ecard_by_recipient_name' => 'به‌ گوێره‌ی ناوی وه‌رگر', //cpg1.3.0
  'ecard_by_recipient_email' => 'به‌ گوێره‌ی پۆستی ئه‌لیكترۆنی وه‌رگر', //cpg1.3.0
  'ecard_number' => 'پێشاندانی تۆماركردن %s بۆ %s %s', //cpg1.3.0
  'ecard_goto_page' => 'بچۆ بۆ لاپه‌ڕه‌', //cpg1.3.0
  'ecard_records_per_page' => 'تۆماركراو له‌ هه‌ر لاپه‌ڕه‌ك', //cpg1.3.0
  'check_all' => 'هه‌موو دیاری كه‌', //cpg1.3.0
  'uncheck_all' => 'دیاری كراوه‌كان ڕه‌ت كه‌وه‌', //cpg1.3.0
  'ecards_delete_selected' => 'پۆست كارتی دیاریكراو بسڕه‌وه‌', //cpg1.3.0
  'ecards_delete_confirm' => 'بۆ خاتری خوا ڕازیت له‌ سڕینه‌وه‌ی ئه‌م پۆست كارته‌ !!', //cpg1.3.0
  'ecards_delete_sure' => 'ئه‌ڕێوه ا‌ڵله‌ ڕازیم بیسڕمه‌وه‌', //cpg1.3.0
);


// ------------------------------------------------------------------------- //
// File db_input.php
// ------------------------------------------------------------------------- //

if (defined('DB_INPUT_PHP')) $lang_db_input_php = array(
        'empty_name_or_com' => 'پێویسته‌ ناوت و لێدوانت بنووست',
        'com_added' => 'سوپاس لێدوانه‌كه‌ت دانرا',
        'alb_need_title' => 'ئه‌لبوومه‌كه‌ پێویستی به‌ سه‌ڕدێڕه‌‌ !',
        'no_udp_needed' => 'پێوست به‌ نوێكردنه‌وه‌ نیه‌.',
        'alb_updated' => 'ئه‌لبوومه‌كه‌ نوێ كراوه‌',
        'unknown_album' => 'ئه‌لبوومی ده‌ستنیشان كراو نیه‌ یان مۆڵه‌تی لكاندن نیه‌',
        'no_pic_uploaded' => 'هیچ په‌ڕگه‌ك نه‌ لكاندرا !<br /><br />ئه‌گه‌ر تۆ به‌ڕاستی وێنه‌كت هه‌ڵبژاردیه‌ بۆ لكاندن, دڵنیابه‌ كه‌ سێرڤه‌ر ڕێگای لكاندنی په‌ڕگه‌ت پێ ئه‌دات...',
        'err_mkdir' => 'هه‌ڵه‌ له‌ ئافراندنی بوخچه‌ %s !',
        'dest_dir_ro' => 'له‌ ڕووی بوخچه‌ %s ڕازی نیه‌ بۆ نووسین !',
        'err_move' => 'زه‌حمه‌ته‌ گواستنه‌وه‌ی %s بۆ %s !',
        'err_fsize_too_large' => 'ئه‌م وێنه‌یه‌ هه‌ڵتبژاردیه‌ قه‌باره‌كه‌ی گه‌وره‌یه‌ بۆ لكاندن (گه‌وره‌ترین قه‌باره‌ی وێنه‌ %s x %s) !',
        'err_imgsize_too_large' => 'ئه‌م وێنه‌یه‌ هه‌ڵتبژاردیه‌ قه‌باره‌كه‌ی زۆر گه‌وره‌یه‌ بۆ لكاندن (گه‌وره‌ترین قه‌باره‌ی وێنه %s KB) !',
        'err_invalid_img' => 'ئه‌م وێنه‌ی هه‌ڵت بژاردیه‌ بۆ لكاندن هه‌ڵه‌یه‌ !',
        'allowed_img_types' => 'تۆ ته‌نها ده‌توانیت بلكێنی %s وێنه‌.',
        'err_insert_pic' => 'وێنه‌ی \'%s\' ناتوانرێت پاشكه‌وت بكرێت له‌ ئه‌لبووم ',
        'upload_success' => 'به‌سه‌ركه‌وتووانه‌ وێنه‌كه‌ لكاندرا<br /><br />ده‌یبینیت دوای ڕازیبوونی به‌ڕێوه‌به‌ر .',
  'notify_admin_email_subject' => '%s - تێبنی لكاندن', //cpg1.3.0
  'notify_admin_email_body' => 'ئه‌م وێنه‌یه‌ لكاندراوه‌ له‌ لایه‌ن %s كه‌ پێویستی به‌ ڕازیبوونی تۆیه‌ %s', //cpg1.3.0
        'info' => 'زانیاری',
        'com_added' => 'سوپاس لێدوانه‌كه‌ لكاندرا',
        'alb_updated' => 'ئه‌لبوومه‌كه‌ نوێكراوه‌',
        'err_comment_empty' => 'ببوره‌ تۆ هیچ لێدوانێكت نه‌ نووسیه‌ !',
        'err_invalid_fext' => 'ته‌نها ڕێگادراوه‌ به‌م په‌ڕگانه‌ی كه‌ كۆتایان هاتیه‌ به‌ : <br /><br />%s.',
        'no_flood' => 'ببوره‌ تۆ دوا كه‌سی بووی كه‌ لێداونت نووسی له‌سه‌ر وێنه‌كه‌<br /><br />ده‌توانی ده‌سكاری لێدوانه‌كه‌ت بكه‌ له‌سه‌ر وێنه‌كه‌',
        'redirect_msg' => 'ئێستا ده‌گوازرێیه‌وه‌ بۆ لاپه‌ڕه‌كی تر.<br /><br /><br />كرته‌ بكه‌ سه‌ر  \'به‌رده‌وام\' ئه‌گه‌ر راسته‌وخۆ نه‌گوازرایه‌وه‌',
        'upl_success' => 'به‌ سه‌ركه‌وتووانه‌ توانرا په‌ڕگه‌كه‌ بلكێندرێت',
  'email_comment_subject' => 'لێدوان خستنه‌سه‌ر كرا', //cpg1.3.0
  'email_comment_body' => 'به‌كارهێنه‌رێك لێدوانی خۆی ناردووه‌ سه‌یری بكه‌', //cpg1.3.0
);

// ------------------------------------------------------------------------- //
// File delete.php
// ------------------------------------------------------------------------- //

if (defined('DELETE_PHP')) $lang_delete_php = array(
        'caption' => 'ناونیشان',
        'fs_pic' => 'وێنه‌ به‌ قه‌باره‌ی گه‌وره‌یی',
        'del_success' => 'به‌ سه‌ركه‌وتووانه‌ سڕایه‌وه‌',
        'ns_pic' => 'وێنه‌ به‌ قه‌باره‌ی ئاسایی',
        'err_del' => 'ناتوانرێت بسڕێته‌وه‌',
        'thumb_pic' => 'كوچكه‌‌',
        'comment' => 'لێدوان',
        'im_in_alb' => 'وێنه‌ له‌ ئه‌لبووم',
        'alb_del_success' => 'ئه‌لبووم \'%s\' توانرا بسڕێته‌وه‌',
        'alb_mgr' => 'به‌ڕێوه‌به‌ری ئه‌لبووم',
        'err_invalid_data' => 'دراوێكی خراپ پێشوازی كرا له‌ \'%s\'',
        'create_alb' => 'ئافراندنی ئه‌لبووم \'%s\'',
        'update_alb' => 'ده‌ستكرا به‌ نوێكردنه‌وه‌ \'%s\' به‌ ناونیشانی \'%s\' وه‌ پێرست \'%s\'',
        'del_pic' => 'سڕینه‌وه‌ی وێنه‌',
        'del_alb' => 'سڕینه‌وه‌ی وێنه‌',
        'del_user' => 'سڕینه‌وه‌ی به‌كارهێنه‌ر',
        'err_unknown_user' => 'به‌كارهێنه‌ری ده‌ستنیشان كراو نیه‌ یان نه‌ناسراوه‌ !',
        'comment_deleted' => 'توانرا به‌ سه‌ركه‌وتووانه‌ لێداونه‌كه‌ بسڕیته‌وه‌',
);

// ------------------------------------------------------------------------- //
// File displayecard.php
// ------------------------------------------------------------------------- //

// Void

// ------------------------------------------------------------------------- //
// File displayimage.php
// ------------------------------------------------------------------------- //

if (defined('DISPLAYIMAGE_PHP')){

$lang_display_image_php = array(
  'confirm_del' => 'تۆ دڵنیای له‌ سڕینه‌وه‌ێ ئه‌م وێنه‌یه‌ ? \\nده‌ست ده‌كرێت به‌ سڕینه‌وه‌', //js-alert //cpg1.3.0
  'del_pic' => 'كلیك بكه‌ بۆ سڕینه‌وه‌ی وێنه‌', //cpg1.3.0
  'size' => '%s له‌ %s خاڵ',
  'views' => '%s جار',
  'slideshow' => 'پێشاندانی به‌دوا یه‌ك‌',
  'stop_slideshow' => 'ڕاگرتنی پێشاندانی به‌دوا یه‌ك‌',
  'view_fs' => 'كلیك بكه‌ بۆ گه‌وره‌كردنی وێنه‌كه‌',
  'edit_pic' => 'ده‌سكاری پێناسه‌ی وێنه‌ بكه‌', //cpg1.3.0
  'crop_pic' => 'ده‌سكاری وێنه‌', //cpg1.3.0
);

$lang_picinfo = array(
        'title' =>'زانیاری ده‌رباره‌ی وێنه‌',
        'Filename' => 'ناوی په‌ڕگه‌',
        'Album name' => 'ناوی ئه‌لبووم',
        'Rating' => 'پله‌ (%s پله دان)',
        'Keywords' => 'كلیلی ووشه‌ ',
        'File Size' => 'قه‌باره‌ی په‌ڕگه‌',
        'Dimensions' => 'ڕووخسار ',
        'Displayed' => 'چه‌ند جار بینراوه‌',
        'Camera' => 'ئامێری وێنه‌',
        'Date taken' => 'ڕێكه‌وتی وێنه‌گیراو',
        'Aperture' => 'عه‌ده‌سه‌ ',
        'Exposure time' => 'كاتی نمایش ',
        'Focal length' => 'ناوه‌ندنی دووری ',
        'Comment' => 'لێدوان',
        'addFav'=>'له‌ دڵخوازی دانێ',
        'addFavPhrase'=>'دڵخواز',
        'remFav'=>'له‌ دڵخوازی بسڕه‌وه‌',
  'iptcTitle'=>'IPTC ناونیشان', //cpg1.3.0
  'iptcCopyright'=>'IPTC مافی له‌به‌رگرتنه‌وه‌', //cpg1.3.0
  'iptcKeywords'=>'IPTC كلیلی ووشه‌', //cpg1.3.0
  'iptcCategory'=>'IPTC هاوپۆل', //cpg1.3.0
  'iptcSubCategories'=>'IPTC به‌شی هاوپۆلی ', //cpg1.3.0
);

$lang_display_comments = array(
        'OK' => 'باشه‌',
        'edit_title' => 'ده‌سكاری ئه‌م لێدوانه‌',
        'confirm_delete' => 'تۆ دڵنیای له‌ سڕینه‌وه‌ی ئه‌م لێدوانه‌ ?',
        'add_your_comment' => 'لێدوانت بخه‌سه‌ر',
        'name'=>'ناو',
        'comment'=>'لێدوان',
        'your_name' => 'نه‌ناسراو',
);

$lang_fullsize_popup = array(
        'click_to_close' => 'كلیك بكه‌ سه‌ر وێنه‌كه‌ بۆ داخستنی ئه‌م په‌نجه‌ره‌',
);

}

// ------------------------------------------------------------------------- //
// File ecard.php
// ------------------------------------------------------------------------- //

if (defined('ECARDS_PHP') || defined('DISPLAYECARD_PHP')) $lang_ecard_php =array(
        'title' => 'پۆست كارت بنێره‌',
        'invalid_email' => '<b>ئاگاداری</b> : پۆستی ئه‌لیكترۆنی هه‌ڵه‌یه‌ !',
        'ecard_title' => 'Post kartek le layan %s bo to',
  'error_not_image' => 'ته‌نها وێنه‌ وه‌ك پۆست كارت ده‌نێردرێت.', //cpg1.3.0
        'view_ecard' => 'Eger weneke dernechu kliki ere bike bo binini Post karteke.',
        'view_more_pics' => 'Kliki ere bike bo binini Post karti tir!',
        'send_success' => 'سوپاس پۆست كارته‌كه‌ به‌ سه‌ركه‌وتووانه‌ ناردرا',
        'send_failed' => 'ببوره‌ خانه‌خوێ سێرڤه‌ر ڕێگا نادات وێنه‌ بنێریت...',
        'from' => 'له‌ لایه‌ن',
        'your_name' => 'ناوت',
        'your_email' => 'پۆستی ئه‌لیكترۆنیت',
        'to' => 'بۆ',
        'rcpt_name' => 'ناوی وه‌رگر',
        'rcpt_email' => 'پۆستی ئه‌لیكترۆنی وه‌رگر',
        'greetings' => 'سڵاو كردن',
        'message' => 'نامه‌',
);

// ------------------------------------------------------------------------- //
// File editpics.php
// ------------------------------------------------------------------------- //

if (defined('EDITPICS_PHP')) $lang_editpics_php = array(
  'pic_info' => 'زانیاری وێنه‌', //cpg1.3.0
  'album' => 'ئه‌لبووم',
  'title' => 'ناونیشانی وێنه‌',
  'desc' => 'ده‌رباره‌و پێناسه‌ی وێنه‌',
  'keywords' => 'ووشه‌ی به‌ڵگه‌ بۆ دۆزینه‌وه‌ی له‌ به‌شی گه‌ڕان',
  'pic_info_str' => '%s &times; %s - %sكيلۆبايت - %s زیاتر بینراوه‌ - %s ده‌نگ دانه‌كان',
  'approve' => 'وێنه‌ی ڕازیكراو', //cpg1.3.0
  'postpone_app' => 'دواخستنی ڕازیبوون',
  'del_pic' => 'سڕینه‌وه‌ی وێنه‌', //cpg1.3.0
  'read_exif' => 'بخوێنه‌وه‌ زانیاری EXIF دووباره‌', //cpg1.3.0
  'reset_view_count' => 'گه‌ڕانه‌وه‌ی چه‌ندجار بینراو',
  'reset_votes' => 'گه‌ڕانه‌وه‌ی پله‌',
  'del_comm' => 'سڕینه‌وه‌ێ لێدوانه‌كان',
  'upl_approval' => 'ڕازی بوونی لكاندن',
  'edit_pics' => 'ده‌سكاری وێنه‌', //cpg1.3.0
  'see_next' => 'وێنه‌ی دواتر', //cpg1.3.0
  'see_prev' => 'وێنه‌ی پێشتر', //cpg1.3.0
  'n_pic' => '%s وێنه‌', //cpg1.3.0
  'n_of_pic_to_disp' => 'ژماره‌ی وێنه‌ی بۆ نیشاندان', //cpg1.3.0
  'apply' => 'پاشكه‌وت كردنی ده‌سكاریه‌كه‌', //cpg1.3.0
  'crop_title' => 'جیهانی مۆسیقا ده‌سكاری پیشانگا', //cpg1.3.0
  'preview' => 'پێشاندان', //cpg1.3.0
  'save' => 'پاشكه‌وت كردنی وێنه‌', //cpg1.3.0
  'save_thumb' =>'له‌ وێنه‌ی تێكه‌وڵاو پاشكه‌وت كه‌', //cpg1.3.0
  'sel_on_img' =>'اهه‌ڵبژارده‌كه‌ پێویسته‌ له‌ سه‌ر وێنه‌كه‌ بێت!', //js-alert //cpg1.3.0
);

// ------------------------------------------------------------------------- //
// File faq.php //cpg1.3.0
// ------------------------------------------------------------------------- //

if (defined('FAQ_PHP')) $lang_faq_php = array(
  'faq' => 'پرسیاری هه‌م دووباره‌', //cpg1.3.0
  'toc' => 'خشته‌ی پرسیاره‌كان', //cpg1.3.0
  'question' => 'پرسیار: ', //cpg1.3.0
  'answer' => 'وه‌ڵام: ', //cpg1.3.0
);

if (defined('FAQ_PHP')) $lang_faq_data = array(
  'پرسیاری گرنگ', //cpg1.3.0
  array('بۆ پێویسته‌ خۆم تۆمار بكه‌م؟', 'گه‌ر بێتوو له‌ لایه‌ن به‌ڕێوه‌به‌ری پیشانگا ڕێگه‌ درابێت بۆ تۆمار كردن ئه‌م كاته‌ ده‌توانی ئه‌لبوومی تایبه‌تی خۆت هه‌بێت وه‌ هه‌روه‌ها ده‌توانی به‌ژداری لێدوان بكه‌ی له‌ سه‌ر وێنه‌ یان وێنه‌ لكاندن بۆ ئه‌لبوومی تایبه‌تی خۆت.', 'allow_user_registration', '0'), //cpg1.3.0
  array('چۆن خۆم تۆماربكه‌م؟', 'بۆ تۆماركردن بچۆ ئه‌م به‌سته‌ره‌ ( <b>
تۆماركردن</b> ) له‌سه‌ری سه‌ره‌وی لاپه‌ڕه‌كه‌ دیاره دوای مافی تۆماركردن بخوێنه‌وه‌ دوای ڕازیبوون
هه‌موو داواكراوه‌كان پڕبكه‌وه‌ به‌ گوێره‌ی داواكراو، دوای تۆماركردن پۆستێكی ئه‌لیكترۆنیت بۆ دێت گه‌ر بێتوو له‌ لایه‌ن به‌ڕێوه‌به‌ران به‌كارخرابێت ئه‌م پۆسته‌ چه‌ند زانیاریه‌كه‌ بۆ چۆنیه‌تی به‌ژدار بوون له‌ لكاندنی وێنه‌ بۆ ئه‌لبووم.', 'allow_user_registration', '1'), //cpg1.3.0
  array('چوون بێمه‌ ژووری پێشانگا؟', 'بۆ هاتنه‌ ژووره‌وه‌ی پێشانگا له‌ سه‌ره‌وه‌ كلیكی ( چوونه‌ ژووره‌وه‌ ) بكه‌ دوای
ناو و ووشه‌ی نهێنی بنووسه‌و كلیكی چوونه‌ ژووره‌وه‌ بكه.‌<br /><b>تێبینی ئه‌م لاپه‌ڕه‌ كه‌وكزی به‌كاردێنت بۆت ئاسان ده‌كات گه‌ر جارێكی تر ڕاسته‌وخۆ بێیه‌ ژووره‌وه‌ گه‌ر بێتوو چوارگۆشه‌‌ی &quot;بیرم بهێنه‌وه‌&quot; چالاك كرابێت.</b></p>
</b>', 'offline', 0), //cpg1.3.0
  array('بۆچی ناتوانم بێمه‌ ژووری پیشانگا؟', 'ئایا تۆ خۆت تۆماركردیه‌ وه‌ كلیكی ئه‌م به‌سته‌ره‌ت كرد كاتێك به‌ پۆستی ئه‌لیكترۆنی بۆت ڕه‌وان كرا؟ . به‌سته‌ره‌كه‌ به‌كارهێنه‌ره‌كه‌ت به‌كارده‌خات. ئه‌مه‌یه‌ كێشه‌كه‌ت گه‌ر چاره‌ نه‌بوو په‌یوه‌ندی به‌ به‌ڕێوه‌به‌ری پیشانگا بكه‌.', 'offline', 0), //cpg1.3.0
  array('گه‌ر ووشه‌ی نهێنیم بیركرد چاره‌؟', 'كلیكی به‌سته‌ری ووشه‌ی نهێنیم بیركردیه‌ له‌ به‌شی چوونه‌ ژووره‌وه‌ ده‌یدۆزیه‌وه‌ له‌ خواره‌وه‌ دوای داوای ناوی چوونه‌ ژووره‌وه‌ یان پۆستی ئه‌لیكترۆنیت لێ ده‌كات كه‌ خۆت پێ تۆماركردیه‌ دوای پۆستێكی ئه‌لیكترۆنیت بۆ ڕه‌وان ده‌كرێت پێك هاتووه‌ له‌ ووشه‌ی نهێنی.', 'offline', 0), //cpg1.3.0
  //array('What if I changed my email address?', 'Just simply login and change your email address through &quot;Profile&quot;', 'offline', 0), //cpg1.3.0
  array('چۆن ده‌توانم وێنه‌ی دڵخواز له‌ به‌شی دڵخواز دانێم ؟', 'له‌سه‌ر وێنه‌كه‌ كرته‌ بكه‌ دوای له‌ خواره‌وه‌ زانیاری وێنه‌كه‌ ده‌بینی له‌ هه‌مان شوێن كلیك بكه‌ سه‌ر به‌سته‌ری له‌ دڵخوازی دانێ<br />.', 'offline', 0), //cpg1.3.0
  
);


// ------------------------------------------------------------------------- //
// File forgot_passwd.php //cpg1.3.0
// ------------------------------------------------------------------------- //

if (defined('FORGOT_PASSWD_PHP')) $lang_forgot_passwd_php = array(
  'forgot_passwd' => 'نامه‌ی به‌بیر هێنانه‌وه‌ێ ووشه‌ی نهێبنی', //cpg1.3.0
  'err_already_logged_in' => 'تۆ به‌ ته‌واوی هاتیه‌ ژووره‌وه‌ یاخوا به‌ خێربێی !', //cpg1.3.0
  'enter_username_email' => 'ناو چوونه‌ ژووره‌وه‌ت بنووسه‌ یان پۆستی ئه‌لیكترۆنی', //cpg1.3.0
  'submit' => 'بنێره‌', //cpg1.3.0
  'failed_sending_email' => 'لێره‌ هه‌ڵه‌ك ڕوویدا نه‌توانرا نامه‌ی به‌بیرهێنانه‌وه‌ێ ووشه‌ی نهێنی بنێردرێت بۆ پۆسته‌كه‌ت !', //cpg1.3.0
  'email_sent' => 'هه‌ر ئێستا ووشه‌ی به‌بیرهێنانه‌وه‌ی ووشه‌ی نهێنیم بۆ ناردی سه‌یری پۆسته‌كه‌ت بكه‌ %s', //cpg1.3.0
  'err_unk_user' => 'هه‌ڵه‌: ئێمه‌ ئه‌م به‌كار‌هێنه‌ره‌مان نیه‌ دووباره‌ تاقی كه‌وه‌', //cpg1.3.0
  'passwd_reminder_subject' => 'ناو و ووشه‌ی نهێنی چوونه‌ ژووره‌وه‌', //cpg1.3.0
  'passwd_reminder_body' => 'دراوه‌كانی لای ئێمه‌ له‌ پیشانگا ئه‌مه‌یه‌:
ناوی به‌كارهێنه‌ر: %s
ووشه‌ی تێپه‌ڕبوون: %s
كلیكی ئێره‌ بكه‌ %s بۆ چوونه‌ ژووره‌وه‌.', //cpg1.3.0
);

// ------------------------------------------------------------------------- //
// File groupmgr.php
// ------------------------------------------------------------------------- //

if (defined('GROUPMGR_PHP')) $lang_groupmgr_php = array(
        'group_name' => 'ناوی گرووپ',
        'disk_quota' => 'به‌شی په‌پكه‌',
        'can_rate' => 'پله‌ دانان له‌ په‌ڕگه‌',
        'can_send_ecards' => 'ده‌توانێت پۆست كارت بنێرێت',
        'can_post_com' => 'ده‌توانێت لێدوان بنووسێت',
        'can_upload' => 'ده‌توانێت په‌ڕگه‌ بلكێنی',
        'can_have_gallery' => 'ده‌توانێت پیشانگای تایبه‌تی هه‌بێت',
        'apply' => 'پاشكه‌وت كردنی ڕێكخستنه‌كه‌',
        'create_new_group' => 'دروستكردنی گرووپێكی نوێ',
        'del_groups' => 'سڕینه‌وه‌ی گرووپی ده‌ستنیشانكراو',
        'confirm_del' => 'ئاگاداری, كاتێك گرووپ ده‌سڕیه‌وه‌, ده‌ست ده‌كات به‌ گواستنه‌وه‌ی به‌كارهێنه‌ره‌كان بۆ لیستی \'تۆماركراوه‌كان\' !\n\nتۆ دڵنیای له‌م كاره‌  ?',
        'title' => 'به‌ڕێوه‌به‌ری گرووپی به‌كارهێنه‌ره‌كان ',
        'approval_1' => 'ڕازیبوون له‌ لكاندنی گشتی (1)',
        'approval_2' => 'ڕازیبوون له‌ لكاندنی تایبه‌تی (2)',
  'upload_form_config' => 'هه‌لبژارده‌ی لكاندن', //cpg1.3.0
  'upload_form_config_values' => array( 'لكاندنی ته‌نیا په‌ڕگه‌', 'لكاندنی چه‌نده‌ها په‌ڕگه‌', 'دانانی ته‌نیا به‌سته‌ری وێنه‌', 'په‌ڕگه‌ی زیپ zip ته‌نیا', 'په‌ڕگه‌‌-به‌سته‌ر', 'به‌سته‌ر-ZIP', 'به‌سته‌ر-ZIP', 'په‌ڕگه‌-به‌سته‌ر-ZIP'), //cpg1.3.0
  'custom_user_upload'=>'به‌كارهێنه‌ر ده‌توانێت ژماره‌كی لكاندنی سندوق زیادبكات؟', //cpg1.3.0
  'num_file_upload'=>'سنووری به‌رزی لكاندنی په‌ڕگه‌ له‌ سندوق', //cpg1.3.0
  'num_URI_upload'=>'سنووری به‌رزی لكاندنی به‌سته‌ر‌ له‌ سندوق', //cpg1.3.0
        'note1' => '<b>(1)</b> لكاندن له‌ ئه‌لبوومی گشتی پێوستی به‌ ڕازی بوونی به‌ڕێوه‌به‌ره‌',
        'note2' => '<b>(2)</b> لكاندنه‌كانی له‌ لایه‌ن به‌كارهێنه‌ر پێوستی به‌ ڕازی بوونی به‌ڕێوه‌به‌ره‌',
        'notes' => 'تێبینیه‌كان'
);

// ------------------------------------------------------------------------- //
// File index.php
// ------------------------------------------------------------------------- //

if (defined('INDEX_PHP')){

$lang_index_php = array(
  'welcome' => 'سڵاو، به‌خێر بێی به‌ڕێز !',
);

$lang_album_admin_menu = array(
        'confirm_delete' => 'تۆ دڵنیایی له‌ سڕینه‌وه‌ی ئه‌م ئه‌لبوومه‌‌ ? \\nهه‌موو وێنه‌كان و لێدوانه‌كان ڕه‌ش ده‌بێته‌وه‌ خۆمان خۆش.',
        'delete' => 'سڕینه‌وه‌ی وێنه‌',
        'modify' => 'تایبه‌تمه‌ندی ئه‌لبووم',
        'edit_pics' => 'ده‌سكاری وێنه‌',
);

$lang_list_categories = array(
        'home' => 'ماڵه‌وه‌',
        'stat1' => '<b>[pictures]</b> وێنه‌ له‌ <b>[albums]</b> ئه‌لبووم وه‌ <b>[cat]</b> هاوپۆل له‌گه‌ڵ <b>[comments]</b> لێدوان <b>[views]</b> جار بینراوه',
        'stat2' => '<b>[pictures]</b> وێنه‌ له <b>[albums]</b> ئه‌لبوم بینراوه‌ <b>[views]</b> جار',
        'xx_s_gallery' => 'پیشانگا %s',
        'stat3' => '<b>[pictures]</b> وێنه‌ له <b>[albums]</b> ئه‌لبوون له‌گه‌ڵ <b>[comments]</b>لێدوان <b>[views]</b> جار بینراوه‌'
);

$lang_list_users = array(
        'user_list' => 'لیستی ئه‌ندامه‌كان',
        'no_user_gal' => 'پیشانگای به‌كارهێنه‌ر نیه‌',
        'n_albums' => '%s ئه‌لبووم',
        'n_pics' => '%s وێنه‌'
);

$lang_list_albums = array(
        'n_pictures' => '%s وێنه‌',
        'last_added' => ', دوا وێنه‌ خستنه‌سه‌ركرا له‌ %s'
);

}

// ------------------------------------------------------------------------- //
// File login.php
// ------------------------------------------------------------------------- //

if (defined('LOGIN_PHP')) $lang_login_php = array(
        'login' => 'چوونه‌ ژووره‌وه‌‌',
        'enter_login_pswd' => 'ناوی چوونه‌ ژووره‌وه‌ له‌گه‌ڵ ووشه‌ی نهێنی بنووسه‌',
        'username' => 'ناوی ئه‌ندام',
        'password' => 'ووشه‌ی نهێنی',
        'remember_me' => 'بیرم بهێنه‌وه‌',
        'welcome' => 'یاخوا به‌خێربێی سه‌رچاو  %s ...',
        'err_login' => '*** ناوتوانیت بچیه‌ ژووره‌وه‌ جارێكی تر هه‌وڵ بده‌ ***',
        'err_already_logged_in' => 'تۆ به‌ ته‌واوی له‌ ژوورێ دای !',
  'forgot_password_link' => 'ووشه‌ی تێپه‌ڕبوونم بیر كردیه‌', //cpg1.3.0
);

// ------------------------------------------------------------------------- //
// File logout.php
// ------------------------------------------------------------------------- //

if (defined('LOGOUT_PHP')) $lang_logout_php = array(
        'logout' => 'ده‌رچوون',
        'bye' => 'خوات له‌گه‌ڵ به‌ڕێز %s ...',
        'err_not_loged_in' => 'تۆ له‌ ژوور نیت !',
);

// ------------------------------------------------------------------------- //
// File phpinfo.php //cpg1.3.0
// ------------------------------------------------------------------------- //

if (defined('PHPINFO_PHP')) $lang_phpinfo_php = array(
  'php_info' => 'PHP info', //cpg1.3.0
  'explanation' => 'This is the output generated by the PHP-function <a href="http://www.php.net/phpinfo">phpinfo()</a>, displayed within Copermine (trimming the output at the right corner).', //cpg1.3.0
  'no_link' => 'Having others see your phpinfo can be a security risk, that\'s why this page is only visible when you\'re logged in as admin. You can not post a link to this page for others, they will be denied access.', //cpg1.3.0
);

// ------------------------------------------------------------------------- //
// File modifyalb.php
// ------------------------------------------------------------------------- //

if (defined('MODIFYALB_PHP')) $lang_modifyalb_php = array(
        'upd_alb_n' => 'تازه‌ كردنه‌وه‌ی ئه‌لبووم %s',
        'general_settings' => 'ئامرازه‌ گشتیه‌كان',
        'alb_title' => 'ناونیشانی ئه‌لبووم',
        'alb_cat' => 'هاوپۆلی ئه‌لبووم',
        'alb_desc' => 'پێناسه‌ی ئه‌لبووم',
        'alb_thumb' => 'نبذة الالبوم',
        'alb_perm' => 'مۆڵه‌تدانی ئه‌لبووم',
        'can_view' => 'ئه‌م ئه‌لبوومه‌ ده‌توانرێت ببینرێت له‌ لایه‌ن',
        'can_upload' => 'مێوانه‌كان ده‌توانن په‌ڕگه‌ بلكێنن',
        'can_post_comments' => 'مێوانه‌كان ده‌توانن لێدوان بخه‌نه‌سه‌ر',
        'can_rate' => 'مێوانه‌كان ده‌توانن پله‌ بده‌ن به‌ وێنه‌',
        'user_gal' => 'پێشانگای به‌كار‌هێنه‌ر',
        'no_cat' => '* پیشانگا نیه‌ *',
        'alb_empty' => 'ئه‌لبووم خاڵیه‌',
        'last_uploaded' => 'دوا لكاندراو',
        'public_alb' => 'بۆ هه‌مووی (ئه‌لبوومی گشتی)',
        'me_only' => 'ته‌نیا بۆخۆم',
        'owner_only' => 'خاوه‌ن ئه‌لبووم (%s) ته‌نیا',
  'groupp_only' => 'ئه‌ندامانی گرووپ \'%s\'',
  'err_no_alb_to_modify' => 'هیج ئه‌لبوومێك ناتوانی ڕیكخه‌ی له‌ دراوه‌كانی بنكه‌ی زانیاری واتا داته‌باسه‌.',
  'update' => 'تازاه‌كردنه‌وه‌ی ئه‌لبووم', //cpg1.3.0
  'notice1' => '(*) كردنه‌وه‌ی ئامرازه‌كانی %sgroups%s', //cpg1.3.0 (do not translate %s!)
);

// ------------------------------------------------------------------------- //
// File ratepic.php
// ------------------------------------------------------------------------- //

if (defined('RATEPIC_PHP')) $lang_rate_pic_php = array(
        'already_rated' => 'ببوره‌ تۆ پێشتر پله‌ت داوه‌ بۆ ئه‌م وێنه‌',
        'rate_ok' => 'سوپاس پله‌دانانه‌كه‌ت دانرا',
  'forbidden' => 'كه‌س بووه‌ پله‌ دانێت بۆ وێنه‌ی خۆی لێگه‌ڕێ خه‌ڵكی تر پله‌ دانێت به‌ڵام به‌هه‌رحاڵ سوپاس.', //cpg1.3.0
);

// ------------------------------------------------------------------------- //
// File register.php & profile.php
// ------------------------------------------------------------------------- //

if (defined('REGISTER_PHP') || defined('PROFILE_PHP')) {

$lang_register_disclamer = <<<EOT
به‌ڕێوه‌بارانی لاپه‌ڕه‌كه‌ {SITE_NAME} ده‌ست ده‌كه‌ن به‌ ده‌ست كاری ئه‌م وێنانه‌ی كه‌ ڕیگایان پێ نه‌دراوه‌ یان ده‌سڕێنه‌وه‌, وه‌ زه‌حمه‌تیشه‌ بتوانی دووباره‌ وێنه‌كان به‌ ده‌ست بهێنیه‌وه‌. ده‌بێت باش بزانی به‌رپرسی وێنه‌كانیش ده‌گه‌ڕێته‌وه‌ بۆ خاوه‌نه‌كانیان هیچ په‌یوه‌ندیه‌كی نیه‌‌ به‌ به‌ڕێوه‌به‌رانی لاپه‌ڕه‌كه‌ (ئه‌گه‌ر ئه‌مه‌ش ڕوویدا) بۆ تێبنی ئێمه‌ به‌رپرسی نین به‌ هیچ شێوه‌ك.<br />
<br />
تۆ ڕازیت كه‌ وێنه‌ی ناشیرین و خراپ و وێنه‌ی تایبه‌ت به‌ كوشتن و مردن یان ڕووت بڵاو نه‌كه‌یه‌وه‌‌ . تۆ ڕازیت له‌ به‌ڕێوه‌باران تۆ به‌ر پرسی, به‌ڕێوه‌به‌ری لاپه‌ڕه‌ {SITE_NAME} مافی ده‌سكاری و ڕێك خستنی ئه‌لبووم و وێنه‌كانت له‌ كاتی گونجاو. وه‌ هه‌روه‌ها ڕازیت كه‌ ئه‌م به‌سته‌ره‌ی خۆت  پاشكه‌وت ده‌بێت له‌ بنكه‌ی زانیاری. بۆ زانیاریت ئه‌م زانیاریانه‌ی تۆ كه‌س نازانێت ئه‌گه‌ر كه‌سی سێمه‌م زانی به‌ هۆیی تۆوه‌ ئه‌م كاته‌ ئێمه‌ به‌رپرسی دزینی زانیاریه‌كانی تۆ نین.<br />
<br />
ئه‌م لاپه‌ڕه‌یه‌ كه‌وكز به‌كارده‌هێنێت بۆ پاشكه‌وت كردنی زانیاریه‌كانت له‌سه‌ر كۆمپیوته‌ره‌كه‌ت. ئه‌م كه‌وكزه‌ ته‌نها باشی دانی وێنه‌ ده‌دات. وه‌ پۆستی ئه‌لیكترۆنی به‌كارده‌هێنێت بۆ تۆماكردنه‌كه‌ت وه‌ ناردنی ووشه‌ی نهێنی.<br />
<br />
‌ كلیكی دوگمه‌ی 'ڕازیم' بكه‌ بۆ ڕازی بوونی مه‌رجه‌كان.
EOT;

$lang_register_php = array(
        'page_title' => 'تۆماركردنی به‌كارهێنه‌ر',
        'term_cond' => 'مه‌رجی تۆماركردن',
        'i_agree' => 'ڕازیم',
        'submit' => 'تۆماركردن',
        'err_user_exists' => 'ئه‌م ناوه‌ی چوونه‌ ژووره‌وه‌ هه‌یه‌, به‌ یارمه‌تیت ناوێكی تر هه‌ڵبژێره‌',
        'err_password_mismatch' => 'ووشه‌ نهێنیه‌كان وه‌ك یه‌ك نین، پێوسیته‌ جارێكی تر بینووسیه‌وه‌',
        'err_uname_short' => 'پێویسته‌ ناوی چوونه‌ ژووره‌ له‌ دوو پیت زیاتر بێت',
        'err_password_short' => 'پێویسته‌ ووشه‌ی نهێنی له‌ دوو پیت زیاتر بێت',
        'err_uname_pass_diff' => 'پێویسته‌ ناوی چوونه‌ ژووره‌وه‌ جیا بێت له‌گه‌ڵ ووشه‌ی نهێنی',
        'err_invalid_email' => 'پۆستی ئه‌لیكترۆنی هه‌ڵه‌یه‌',
        'err_duplicate_email' => 'به‌كار‌هێنه‌ره‌كی تر هه‌مان پۆستی ئه‌لكترۆنی هه‌یه‌',
        'enter_info' => 'دانانانی دراوه‌كانی تۆماركردن',
        'required_info' => 'زانیاری داواكراو',
        'optional_info' => 'زنایرای زیاتر',
        'username' => 'ناوی چوونه‌ ژووره‌وه‌',
        'password' => 'ووشه‌ی نهێنی',
        'password_again' => 'دووباره‌ ووشه‌ی نهێنی بنووسه‌',
        'email' => 'پۆستی ئه‌لیكترۆنی',
        'location' => 'شوێن',
        'interests' => 'هیوایه‌ت',
        'website' => 'لاپه‌ڕه‌كه‌ت',
        'occupation' => 'كاروبارت',
        'error' => 'هه‌ڵه‌',
        'confirm_email_subject' => '%s - دڵنیابوونی تۆماركردن',
        'information' => 'دراوه‌كان',
        'failed_sending_email' => 'نه‌توانرا بنێردرێت نامه‌ی دڵنیابوونی تۆماركردن !',
        'thank_you' => 'سوپاس بۆ تۆماركردن.<br /><br />پۆسته‌كه‌ ناردرا چه‌ند زانیاریه‌كی له‌گه‌ڵه‌ بۆ چۆنیه‌تی به‌ژدار بوون.',
        'acct_created' => 'ئیستا ئافراندرا، به‌ ناوو چوونه‌ ژووره‌وه‌ت له‌گه‌ڵ ووشه‌ی نهێنی وه‌ره‌‌ ژووره‌وه‌',
        'acct_active' => 'به‌ژداریه‌كه‌ت به‌كارخرا، به‌ ناوی چوونه‌ ژووره‌وه‌ت له‌گه‌ڵ ووشه‌ی نهێنی وه‌ره‌‌ ژووره‌وه',
        'acct_already_act' => 'به‌ژداریت پێشتر به‌كارخراوه‌ !',
        'acct_act_failed' => 'ناتوانی ئه‌مه‌ بكه‌ی !',
        'err_unk_user' => 'به‌كارهێنه‌ری دیاریكراو ئاماده‌نیه‌ !',
        'x_s_profile' => 'زانیاریه‌كان %s',
        'group' => 'گرووپ',
        'reg_date' => 'تۆماركرا',
        'disk_usage' => 'شوێنی پاشكه‌وتكردن',
        'change_pass' => 'گۆڕینی ووشه‌ی نهێنی',
        'current_pass' => 'ووشه‌ی نهێنی ئیستا',
        'new_pass' => 'ووشه‌ی نهێنی نوێ',
        'new_pass_again' => 'ووشه‌ی نهێنی دووباره‌ بنووسه‌وه‌',
        'err_curr_pass' => 'ووشه‌ی نهێنی ئیستات هه‌ڵه‌یه‌',
        'apply_modif' => 'ڕازیبوونی ده‌سكاریه‌كه‌',
        'change_pass' => 'ووشه‌ی نهێنی بگۆڕه‌',
        'update_success' => 'به‌سه‌ركه‌وتووانه‌ زانیاریه‌كانت نوێكراوه‌',
        'pass_chg_success' => 'به‌سه‌ركه‌وتووانه‌ ووشه‌ی نهێنی گۆڕا',
        'pass_chg_error' => 'ووشه‌ی نهێنی نه‌گۆڕدرا',
  'notify_admin_email_subject' => '%s - تۆماركردندێكی نوێ', //cpg1.3.0
  'notify_admin_email_body' => 'ئه‌ندامێكی نوێ به‌م ناوه‌ "%s" تۆماركرا له‌ پیشانگاكه‌ت', //cpg1.3.0
);

$lang_register_confirm_email = <<<EOT
سوپاست بۆ ناو تۆماركردنه‌كه‌ت له‌ لایه‌ن {SITE_NAME}

 ناوی چوونه‌ ژوور : "{USER_NAME}"
ووشه‌ی تێپه‌ڕبوون : "{PASSWORD}"

بۆ به‌كارخستنی به‌كارهێنه‌ره‌كه‌ت كلیكی ئه‌م به‌سته‌ره‌ بكه‌ بۆ به‌كارخستنیی.

{ACT_LINK}

له‌گه‌ڵ ڕێزو سڵاو,

به‌ڕێوه‌به‌ری لاپه‌ڕه‌ی {SITE_NAME}

EOT;

}

// ------------------------------------------------------------------------- //
// File reviewcom.php
// ------------------------------------------------------------------------- //

if (defined('REVIEWCOM_PHP')) $lang_reviewcom_php = array(
        'title' => 'گه‌ڕانه‌وه‌ بۆ لێدوانه‌كان',
        'no_comment' => 'لێدوان نیه‌ بۆ گه‌ڕانه‌وه‌',
        'n_comm_del' => '%s لێدوانه‌كه‌ سڕایه‌وه‌',
        'n_comm_disp' => 'ژماره‌ی پێشاندانی لێدوانه‌كان',
        'see_prev' => 'پێشتر',
        'see_next' => 'دواتر',
        'del_comm' => 'سڕینه‌وه‌ی لێدوانه‌كانی ده‌ست نیشان كراون',
);


// ------------------------------------------------------------------------- //
// File search.php - OK
// ------------------------------------------------------------------------- //

if (defined('SEARCH_PHP')) $lang_search_php = array(
        0 => 'گه‌ڕان به‌ دوای وێنه‌',
);

// ------------------------------------------------------------------------- //
// File searchnew.php
// ------------------------------------------------------------------------- //

if (defined('SEARCHNEW_PHP')) $lang_search_new_php = array(
        'page_title' => 'گه‌ڕان به‌دوای په‌ڕگه‌ی نوێ',
        'select_dir' => 'بوخچه‌ هه‌ڵبژێره‌',
        'select_dir_msg' => 'ئه‌م كاره‌ ڕێگات پێ ده‌دات بۆ خستنه‌سه‌ری په‌ڕگه‌ كه‌ لكاندراوه‌ به‌ به‌رنامه‌ی FTP بۆ سێرڤه‌ره‌كه‌ت.<br /><br />ئه‌م بوخچه‌یه‌ هه‌ڵبژێره‌ كه‌ وێنه‌كانت تێدا لكاندووه.‌',
        'no_pic_to_add' => 'ویێنه‌ی خستنه‌سركراو نیه‌',
        'need_one_album' => 'به‌ لایه‌نی كه‌می پێوسیتت به‌ ئه‌لبوومێكه‌ بۆ ئه‌م كاره‌',
        'warning' => 'ئاگاداری',
        'change_perm' => 'ئه‌م سكریپته‌‌ ناتوانێت له‌م بوخچه‌یه‌ خستنه‌سه‌ری په‌ڕگه‌ بكات, پێویسته‌ مۆڵه‌تی 755 یان 777 پێش خستنه‌سه‌ری په‌ڕگه‌ !',
        'target_album' => '<b>وێنه‌كه‌ بخه‌ره‌ &quot;</b>%s<b>&quot; بۆ‌ </b>%s',
        'folder' => 'بوخچه‌',
        'image' => 'وێنه‌',
        'album' => 'ئه‌لبووم',
        'result' => 'ئه‌نجام',
        'dir_ro' => 'ڕازی نیه‌ بۆ نووسین. ',
        'dir_cant_read' => 'ڕازی نیه‌ بۆ خوێندنه‌وه‌. ',
        'insert' => 'خستنه‌سه‌ری وێنه‌ی نوێ بۆ پیشانگا',
        'list_new_pic' => 'لیستی ئه‌لبوومه‌ نوێیه‌كان',
        'insert_selected' => 'دانانی وێنه‌ی دیاریكراو',
        'no_pic_found' => 'وێنه‌ی نوێ نیه‌',
        'be_patient' => 'به‌یارمه‌تیت له‌ سه‌ره‌خۆ، به‌رانه‌مه‌كه‌ پێویستی به‌چه‌ند كاتێكه‌ بۆ خستنه‌سه‌ری وێنه‌كه‌',
  'no_album' => 'ئه‌لبووم دیاری نه‌كراوه‌',  //cpg1.3.0
  'notes' =>  '<ul>'.
                                '<li><b>OK</b> : واتا وێنه‌كه‌ به‌سه‌ركه‌وتووانه‌ خستنه‌سه‌ر كرا'.
                                '<li><b>DP</b> : واتا ئه‌م وێنه‌یه‌ دووباره‌یه‌ له‌ خشته‌ی دراوه‌كان وه‌ تا ئێستا ماوه‌‌'.
                                '<li><b>PB</b> : واتا ناتوانرێت خستنه‌سه‌ر بكرێت, دڵنیا به‌ له‌ ئامرازه‌كانی مۆڵه‌تی لكاندنی وێنه‌ له‌م بوخچه‌یه‌'.
                          '<li><b>NA</b> : means that you haven\'t selected an album the files should go to, hit \'<a href="javascript:history.back(1)">back</a>\' and select an album. If you don\'t have an album <a href="albmgr.php">create one first</a></li>'.
                                '<li>ئه‌گه‌ر نیشانه‌ی OK, DP, PB ده‌رناچێت كلیكی ئه‌م به‌سته‌ره‌ بكه‌ بۆ زانینی هۆی ده‌رنه‌چوونی PHP'.
                                '<li>ئه‌گه‌ر لاپه‌ڕه‌كه‌ وه‌ڵامی نه‌دایه‌وه‌ له‌ ماوكی درێژ, كلیكی دوگمه‌كه‌ بكه‌وه‌ دووباره‌‌'.
                          '</ul>', //cpg1.3.0
  'select_album' => 'ئه‌لبوومێك هه‌ڵبژێره‌', //cpg1.3.0
  'check_all' => 'هه‌ڵبژاردنی هه‌مووی‌', //cpg1.3.0
  'uncheck_all' => 'لابردنی هه‌مووی‌', //cpg1.3.0
);


// ------------------------------------------------------------------------- //
// File thumbnails.php
// ------------------------------------------------------------------------- //

// Void

// ------------------------------------------------------------------------- //
// File banning.php
// ------------------------------------------------------------------------- //

if (defined('BANNING_PHP')) $lang_banning_php = array(
                'title' => 'ڕێگرتنی به‌كارهێنه‌ر',
                'user_name' => 'ناوی به‌كارهێنه‌ر',
                'ip_address' => 'IP ژماره‌ی',
                'expiry' => 'ته‌واو ده‌بێت له‌ (گه‌ر خاڵی بێت واتا ته‌واو نابێت)',
                'edit_ban' => 'پاشكه‌وت كردنی ده‌سكاریه‌كه‌',
                'delete_ban' => 'سڕینه‌وه‌',
                'add_new' => 'خستنه‌سه‌ری ڕێگرتنی نوێ',
                'add_ban' => 'خستنه‌سه‌ر',
  'error_user' => 'ئه‌م به‌كارهێنه‌ره‌ نیه‌', //cpg1.3.0
  'error_specify' => 'تۆ پێویسته‌ ناوی به‌كار‌هێنه‌ر یان ژماری ئای پی بنده‌ی', //cpg1.3.0
  'error_ban_id' => 'اژماره‌ ئای پی هه‌ڵه‌یه‌!', //cpg1.3.0
  'error_admin_ban' => 'ئه‌وه‌ تۆ ئاگات له‌ خۆێه‌ كه‌س بووه‌ ڕێگای خۆی بگرێت ئاوێكی سارد بخۆوه‌!', //cpg1.3.0
  'error_server_ban' => 'ئه‌مه‌ تۆ هه‌وڵی ڕێگرتنی سێرڤه‌ری خۆتی؟ وه‌وه‌ی ئه‌م كاره‌ به‌ من ناكرێت...', //cpg1.3.0
  'error_ip_forbidden' => 'ناتوانیت ئه‌م ئای پیه‌ ڕێبگریت چوونه‌ ناتوانرێت بنووسرێت!', //cpg1.3.0
  'lookup_ip' => 'پشكنینی زانیاری زیاتری IP', //cpg1.3.0
  'submit' => 'پشكنین!', //cpg1.3.0
);

// ------------------------------------------------------------------------- //
// File upload.php
// ------------------------------------------------------------------------- //

if (defined('UPLOAD_PHP')) $lang_upload_php = array(
  'title' => 'لكاندنی په‌ڕگه‌', //cpg1.3.0
  'custom_title' => 'Customized Request Form', //cpg1.3.0
  'cust_instr_1' => 'You may select a customized number of upload boxes. However, you may not select more than the limits listed below.', //cpg1.3.0
  'cust_instr_2' => 'ژماره‌ی سندوقی زبڵ', //cpg1.3.0
  'cust_instr_3' => 'سندوقی لكاندنی په‌ڕگه‌: %s', //cpg1.3.0
  'cust_instr_4' => 'به‌سته‌ر/ به‌سته‌ری : %s', //cpg1.3.0
  'cust_instr_5' => 'به‌سته‌ری لكاندن:', //cpg1.3.0
  'cust_instr_6' => 'سندوقی لكاندنی په‌ڕگه:', //cpg1.3.0
  'cust_instr_7' => 'به‌یارمه‌تیت ژماره‌ی سندوقی لكاندن بنووسه‌ بۆ هه‌ر تیپێك.  دوای كلیكی بكه‌ سه‌ر \'به‌رده‌وام\'. ', //cpg1.3.0
  'reg_instr_1' => 'دراوه‌كی هه‌ڵه‌یه‌.', //cpg1.3.0
  'reg_instr_2' => 'ئێستا ده‌توانیت په‌ڕگه‌ بلكێنی بۆ سندوقی لكاندن. قه‌باره‌ی هه‌ر په‌ڕگه‌یه‌ك بۆ سندوقی لكاندن له‌ لایه‌ن تۆ بۆ سێرڤه‌ر نابێت له‌   %s كیلۆبایت زیاتربێت .', //cpg1.3.0
  'reg_instr_3' => 'If you want the zipped file or archive to be decompressed, you must use the file upload box provided in the \'Decompressive ZIP Upload\' area.', //cpg1.3.0
  'reg_instr_4' => 'ئه‌گه‌ر بێتوو به‌سته‌ر/به‌سته‌ر لكاندن دانێی, پێویسته‌ ناوی ته‌واوی به‌سته‌ر بنووسی وه‌ك ئه‌م نموونه‌یه‌: http://www.mysite.com/images/example.jpg', //cpg1.3.0
  'reg_instr_5' => 'گه‌ر هه‌مووت پڕكرده‌وه‌ به‌ ته‌واوی, به‌یارمه‌تیت كلیكی بكه‌ سه‌ر \'به‌رده‌وام\'.', //cpg1.3.0
  'reg_instr_6' => 'Decompressive ZIP Uploads:', //cpg1.3.0
  'reg_instr_7' => 'لكاندنی وێنه‌:', //cpg1.3.0
  'reg_instr_8' => 'به‌سته‌ر/ به‌سته‌ری لكاندن:', //cpg1.3.0
  'error_report' => 'ڕاپۆرتی هه‌ڵه‌', //cpg1.3.0
  'error_instr' => 'ئه‌م هه‌ڵانه‌ هه‌یه‌ له‌ لكاندنی په‌ڕگه‌كه‌:', //cpg1.3.0
  'file_name_url' => 'ناوی وێنه‌/به‌سته‌ر', //cpg1.3.0
  'error_message' => 'نامه‌ی هه‌ڵه‌', //cpg1.3.0
  'no_post' => 'په‌ڕگه‌ نه‌ لكاندرا به‌ پۆست.', //cpg1.3.0
  'forb_ext' => 'Forbidden file extension.', //cpg1.3.0
  'exc_php_ini' => 'Exceeded filesize allowed in php.ini.', //cpg1.3.0
  'exc_file_size' => 'Exceeded filesize permitted by CPG.', //cpg1.3.0
  'partial_upload' => 'Only a partial upload.', //cpg1.3.0
  'no_upload' => 'په‌ڕگه‌ نه‌ لكاندرا به‌ ته‌واوی.', //cpg1.3.0
  'unknown_code' => 'نه‌ناسراو PHP لكاندن كۆد.', //cpg1.3.0
  'no_temp_name' => 'نه‌ لكاندرا - ناوی په‌ڕگه‌ نیه‌.', //cpg1.3.0
  'no_file_size' => 'هیچ دراوێك نیه‌ / تێك چووه‌‌', //cpg1.3.0
  'impossible' => 'زه‌حمه‌ته‌ گواستنه‌وه‌ی.', //cpg1.3.0
  'not_image' => 'هیچ وێنه‌ك نیه‌ / تێك چووه‌', //cpg1.3.0
  'not_GD' => 'تایبه‌تی GD نیه‌.', //cpg1.3.0
  'pixel_allowance' => 'هه‌ڵه‌ی ژماره‌ی خاڵ.', //cpg1.3.0
  'incorrect_prefix' => 'هه‌ڵه‌ی  به‌سته‌ر/ به‌سته‌ر', //cpg1.3.0
  'could_not_open_URI' => 'ناتوانرێت ئه‌م به‌سته‌ره‌ بكرێته‌وه‌.', //cpg1.3.0
  'unsafe_URI' => 'پارێزی ڕێگانادات.', //cpg1.3.0
  'meta_data_failure' => 'هه‌ڵه‌ی دراوی مێتا', //cpg1.3.0
  'http_401' => '401 هه‌ڵه‌ی ژماره‌', //cpg1.3.0
  'http_402' => '402 هه‌ڵه‌ی ژماره‌', //cpg1.3.0
  'http_403' => '403 هه‌ڵه‌ی ژماره‌', //cpg1.3.0
  'http_404' => 'نه‌دۆزراوه‌ 404 هه‌ڵه‌ی ژماره‌', //cpg1.3.0
  'http_500' => '500 هه‌ڵه‌ی ژماره‌', //cpg1.3.0
  'http_503' => '503 هه‌ڵه‌ی سێرڤه‌ر', //cpg1.3.0
  'MIME_extraction_failure' => 'MIME could not be determined.', //cpg1.3.0
  'MIME_type_unknown' => 'نه‌ناسراو MIME فۆڕمات', //cpg1.3.0
  'cant_create_write' => 'ناتوانڕێت په‌ڕگه‌ ئافراندن بكرێت.', //cpg1.3.0
  'not_writable' => 'ناتوانرێت بنووسرێت بۆ په‌ڕگه‌.', //cpg1.3.0
  'cant_read_URI' => 'ناتوانرێت بخوێندرێته‌وه‌  به‌سته‌ر/ به‌سته‌ر', //cpg1.3.0
  'cant_open_write_file' => 'ناتوانرێت به‌سته‌ری په‌ڕگه‌ بكرێته‌وه‌.', //cpg1.3.0
  'cant_write_write_file' => 'ناتوانرێت بنووسرێت بۆ به‌سته‌ری په‌ڕگه‌.', //cpg1.3.0
  'cant_unzip' => 'ناتوانرێت بپێچرێته‌وه‌ یان زیپ بكرێت.', //cpg1.3.0
  'unknown' => 'هه‌ڵه‌ێ نه‌ناسراو', //cpg1.3.0
  'succ' => 'به‌سه‌ركه‌وتووانه‌ په‌ڕگه‌كه‌ لكاندرا', //cpg1.3.0
  'success' => '%s لكاندرا به‌ سه‌ركه‌وتووانه‌.', //cpg1.3.0
  'add' => 'به‌یارمه‌تیت كلیكی \'به‌رده‌وام\' بۆ خستنه‌سه‌ری په‌ڕگه‌كه‌ بۆ ئه‌لبووم.', //cpg1.3.0
  'failure' => 'هه‌ڵه‌ی لكاندن', //cpg1.3.0
  'f_info' => 'زانیاری هه‌ڵه‌', //cpg1.3.0
  'no_place' => 'په‌ڕگه‌ی پێشوو ناتوانرێت جێ بكرێته‌وه‌.', //cpg1.3.0
  'yes_place' => 'په‌ڕگه‌ی پێشوو به‌ سه‌ركه‌وتووانه‌ جێی بۆ كراوه‌.', //cpg1.3.0
  'max_fsize' => 'به‌رزترین قه‌باره‌ی په‌ڕگه‌ %s كیلۆبایته‌',
  'album' => 'ئه‌لبووم',
  'picture' => 'وێنه‌', //cpg1.3.0
  'pic_title' => 'ناونیشانی وێنه‌', //cpg1.3.0
  'description' => 'پێناسه‌ی وێنه‌', //cpg1.3.0
  'keywords' => 'كلییلی ووشه‌ (ده‌توانی بۆشیان هه‌بێت)',
  'err_no_alb_uploadables' => 'ببوره‌ هیچ ئه‌لبوومێك ئاماده‌نیه‌ بۆ لكاندنی په‌ڕگه‌', //cpg1.3.0
  'place_instr_1' => 'به‌یارمه‌تیت شوێنی په‌ڕگه‌ بكه‌وه‌ له‌ ئه‌لبووم.  تۆ ده‌توانی زانیاری هه‌ر په‌ڕگه‌یه‌ك بنووسی ئێستا .', //cpg1.3.0
  'place_instr_2' => 'په‌ڕگه‌ی تر پێویستی به‌ شوێنه‌. به‌یارمه‌تیت كلیك بكه‌ سه‌ر \'به‌رده‌وام\'.', //cpg1.3.0
  'process_complete' => 'تۆ به‌سه‌ركه‌وتووانه‌ شوێنی هه‌موو په‌ڕگه‌كانت كرده‌وه‌.', //cpg1.3.0
);

// ------------------------------------------------------------------------- //
// File usermgr.php
// ------------------------------------------------------------------------- //

if (defined('USERMGR_PHP')) $lang_usermgr_php = array(
        'title' => 'به‌ڕێوه‌به‌راتی به‌كارهێنه‌ره‌كان',
        'name_a' => 'به‌ گوێره‌ی‌ سه‌رووی ناو',
        'name_d' => 'به‌ گوێره‌ی خوارووی ناو',
        'group_a' => 'به‌ گوێره‌ی‌ سه‌رووی گرووپ',
        'group_d' => 'به‌ گوێره‌ی‌ خوارووی گرووپ',
        'reg_a' => 'به‌ گوێره‌ی‌ سه‌رووی تۆماركراو',
        'reg_d' => 'به‌ گوێره‌ی‌ خوارووی تۆماركراو',
        'pic_a' => 'به‌ گوێره‌ی‌ سه‌رووی ژماره‌ی وێنه‌',
        'pic_d' => 'به‌ گوێره‌ی‌ خوارووی ژماره‌ی وێنه‌',
        'disku_a' => 'به‌ گوێره‌ی‌ سه‌رووی په‌پكه‌ ',
        'disku_d' => 'به‌ گوێره‌ی‌ خوارووی په‌پكه‌',
  'lv_a' => 'به‌ گوێره‌ی‌ سه‌رووی سه‌ردانه‌كان', //cpg1.3.0
  'lv_d' => 'به‌ گوێره‌ی‌ خوارووی سه‌ردانه‌كان', //cpg1.3.0
        'sort_by' => 'به‌كارهێنه‌ره‌كان ڕیز بكه‌ به‌ گوێره‌ی',
        'err_no_users' => 'خشته‌ی به‌كارهێنه‌ر خاڵیه‌ !',
        'err_edit_self' => 'تۆ ناتوانی دراوه‌كانی خۆت ده‌سكاری كه‌ی, كلیكی دووگمه‌ی \'زانیاریه‌كانم\' بكه‌',
        'edit' => 'ده‌سكاری',
        'delete' => 'سڕینه‌وه‌',
        'name' => 'ناوی به‌كارهێنه‌ر',
        'group' => 'گرووپ',
        'inactive' => 'له‌كارخراو',
        'operations' => 'كاره‌كان',
  'pictures' => 'وێنه‌', //cpg1.3.0
  'disk_space' => 'شوێنی به‌كارهاتوو / به‌ش‌',
  'registered_on' => 'تۆماركرا له‌',
  'last_visit' => 'دوا سه‌ردان', //cpg1.3.0
  'u_user_on_p_pages' => '%d به‌كارهێنه‌ر له‌ %d لاپه‌ڕه‌/ لاپه‌ڕه‌كان',
        'confirm_del' => 'تۆ دڵنیای له‌ سڕینه‌وه‌ی ئه‌م به‌كارهێنه‌ره ? \\nهه‌موو وێنه‌كان و په‌ڕگه‌و ئه‌لبووم ده‌سڕێته‌وه‌.',
        'mail' => 'پۆست',
        'err_unknown_user' => 'به‌كارهێنه‌ری دیاری كراو نیه‌ یان نه‌ناسراوه‌ !',
        'modify_user' => 'گۆڕینی به‌كارهێنه‌ر',
        'notes' => 'تێبینیه‌كان',
        'note_list' => '<li>گه‌ر ناته‌وێت ووشه‌ی تێپه‌ڕبوونی بگۆڕیت, چوارگۆشه‌ی ووشه‌ی نهێنی واز لێبینه‌ به‌ به‌تاڵی',
  'password' => 'ووشه‌ی نهێنی',
  'user_active' => 'به‌كارهێنه‌ر به‌كارخراوه‌',
  'user_group' => 'گرووپی به‌كارهێنه‌ره‌كان',
  'user_email' => 'پۆستی ئه‌لیكترۆنی به‌كارهێنه‌ر',
  'user_web_site' => 'به‌سته‌ری به‌كارهێنه‌ر',
  'create_new_user' => 'ئافراندنی به‌كارهێنه‌ره‌كی نوێ',
  'user_location' => 'ووڵاتی به‌كارهێنه‌ر',
  'user_interests' => 'هیوایه‌ته‌كانی به‌كارهێنه‌ر',
  'user_occupation' => 'كاروباری به‌كارهێنه‌ر',
  'latest_upload' => 'دوا لكاندراوه‌كان', //cpg1.3.0
  'never' => 'هه‌رگیز', //cpg1.3.0
);

// ------------------------------------------------------------------------- //
// File util.php
// ------------------------------------------------------------------------- //

if (defined('UTIL_PHP')) $lang_util_php = array(
  'title' => 'تغيير قياس الصورة', //cpg1.3.0
        'what_it_does' => 'ئه‌مانه‌ چی ده‌كه‌ن',
        'what_update_titles' => 'ده‌سكاری سه‌ڕدێر له‌ ناوی په‌ڕگه‌كان',
        'what_delete_title' => 'سڕینه‌وه‌ی سه‌ڕدێڕ',
        'what_rebuild' => 'گه‌ڕانه‌وه‌ی بنه‌ڕه‌تی سایزو كوچكه‌ی وێنه‌',
        'what_delete_originals' => 'سڕینه‌وه‌ی سه‌رچشمه‌ی سایزی وێنه',
        'file' => 'په‌ڕگه‌',
        'title_set_to' => 'سه‌ردێڕ دانرا بۆ',
        'submit_form' => 'بنێره',
        'updated_succesfully' => 'به‌ سه‌ركه‌وتووانه‌ تازه‌كراوه',
        'error_create' => 'هه‌ڵه‌ له ئافراندنی',
        'continue' => 'چاره‌سه‌ركردنی وێنه‌ی تر',
        'main_success' => 'په‌ڕگه %s توانرا به‌كاربخرێت له‌ په‌ڕگه‌ی سه‌ره‌كی',
        'error_rename' => 'هه‌ڵه‌ له‌ گۆڕینی ناو %s بۆ %s',
        'error_not_found' => 'په‌ڕگه %s نه‌دۆزراوه',
        'back' => 'گه‌ڕانه‌وه‌ بۆ سه‌ره‌كی',
        'thumbs_wait' => 'تازه‌كردنه‌وه‌ی وێنه‌, تكایه‌ چاوه‌روان بكه‌...',
        'thumbs_continue_wait' => 'به‌رداوه‌م تازه‌كردنه‌وه‌وی وێنه‌...',
        'titles_wait' => 'تازه‌كردنه‌وه‌ی سه‌ڕدێڕ, تكایه‌ چاوه‌ڕێ بكه...',
        'delete_wait' => 'سڕینه‌و‌ه‌ی سه‌ڕدێڕ, تكایه‌ چاوه‌ڕێ بكه...',
        'replace_wait' => 'سڕینه‌وه‌ی وێنه‌ی ئه‌سڵی دانانی وێنه‌كی تر له‌شوێنی, تكایه‌ چاوه‌ڕێ بكه..',
        'instruction' => 'زانیاری خێرا',
        'instruction_action' => 'هه‌لبژاردنی بكه‌رێك',
        'instruction_parameter' => 'دانانی گۆڕینێك',
        'instruction_album' => 'ئه‌لبوومێك دیاری كه‌',
        'instruction_press' => 'كلیك بكه‌ سه‌ر %s',
        'update' => 'تازه‌كردنه‌وه‌ی كوچكه‌ی وێن‌‌/یان گه‌ڕاندنه‌وه‌ی سایزی وێنه‌',
        'update_what' => 'چی پێویسته‌ تازه‌بكرێته‌وه',
        'update_thumb' => 'ته‌نها كوچكه‌ی وێنه‌',
        'update_pic' => 'ته‌نها گه‌ڕانه‌وه‌ی سایزی وێنه‌',
        'update_both' => 'هه‌ردوو كوچكه‌ و سایزی وێنه‌ پێكه‌وه‌‌',
        'update_number' => 'ژماره‌ی چاره‌سه‌ر كردنی وێنه‌ له‌ هه‌ر كرته‌ك',
        'update_option' => '(هه‌وڵ بده‌ ئامرازی نزمی بۆ دانی گه‌ر تووشی كات ته‌واو بوونی خوێندنه‌وه‌ی بووی )',
        'filename_title' => 'ناوی وێنه‌ &rArr; ناونیشانی وێنه',
        'filename_how' => 'چۆن ناوی په‌ڕگه‌ ده‌گۆڕیت',
        'filename_remove' => 'سڕینه‌وه‌ێ كۆتای .jpg له‌ جێگای دانێ _ (هێڵی خواروو) له‌ نێوانیان',
        'filename_euro' => 'بگۆڕه 2003_11_23_13_20_20.jpg بۆ 23/11/2003 13:20',
        'filename_us' => 'گۆڕین  2003_11_23_13_20_20.jpg بۆ  11/23/2003 13:20',
        'filename_time' => 'گۆڕین  2003_11_23_13_20_20.jpg الى 13:20',
        'delete' => 'سڕینه‌وه‌ی سه‌ڕدێڕی وێنه یان قه‌باره‌ی ئه‌سڵی وێنه',
        'delete_title' => 'سڕینه‌وه‌ی سه‌ڕدێڕی وێنه',
        'delete_original' => 'سڕینه‌وه‌ی قه‌باره‌ی ئه‌سڵی وێنه',
        'delete_replace' => 'سڕینه‌وه‌ی وێنه‌ی ئه‌سڵی دانانی وێنه‌كی تر له‌ شوێنی به‌ قه‌باره‌كی تر',
        'select_album' => 'ئه‌لبووم هه‌ڵبژێره',
  'delete_orphans' => 'سڕینه‌وه‌ی لێدوانه‌كان كه‌ ماوه‌كه‌ به‌سته‌ری وێنه‌ نیه (هه‌موو ئه‌لبوومه‌كان ده‌گرێته‌وه)', //cpg1.3.0
  'orphan_comment' => 'لێدوانه‌كانی كه‌ ماوه‌كه‌ به‌سته‌ری وێنه‌ نیه‌ دۆزراوه', //cpg1.3.0
  'delete' => 'سڕینه‌وه', //cpg1.3.0
  'delete_all' => 'سڕینه‌وه‌ی هه‌مووی', //cpg1.3.0
  'comment' => 'بۆچوونه‌كان: ', //cpg1.3.0
  'nonexist' => 'ربط بالملف الغير موجود # ', //cpg1.3.0
  'phpinfo' => 'پێشاندانی زانیاری php', //cpg1.3.0
  'update_db' => 'تازه‌كردنه‌وه‌ی خشته‌ی بنكه‌ی زانیاری‌', //cpg1.3.0
  'update_db_explanation' => 'ئه‌گه‌ر په‌ڕگه‌ی ترت هێناوه‌ بۆ نوێكردنی وه‌شانێكی تری نوێ، پێویسته‌ به‌ خشته‌ی بنكه‌ی زانیاری دووباره‌ لێبخوریت چونكه‌ خشته‌ی زنایری نوێ ده‌كاته‌وه‌ بۆ تازه‌كردنی وشانی نوێ وه‌ نوێ كردنه‌وه‌ی بنكه‌ی زانیاری .', //cpg1.3.0
);

?>
